espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
/***************************************************************************//**
 * @file
 * @brief Silicon Labs implementation of FreeRTOS Bluetooth Low Energy library.
 *******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

/* Standard library includes */
#include <stddef.h>

/* FreeRTOS BLE HAL includes */
#include "bt_hal_manager_adapter_ble.h"

/* Silicon Labs includes */
#include "sl_bt_hal_gatt_client.h"
#include "sl_bt_hal_gatt_server.h"
#include "sl_bt_hal_manager.h"
#include "sl_bt_hal_common.h"
#include "sl_bt_api.h"
#include "sl_bluetooth_config.h"
#include "sl_malloc.h"

/* Values used for @p phys parameter of @ref sl_bt_scanner_set_timing, @p phys
 * parameter of @ref sl_bt_scanner_set_mode, and @p scanning_phy parameter of
 * @ref sl_bt_scanner_start */
#define SCANNER_PHYS_1M            ((uint8_t) 0x01)
#define SCANNER_PHYS_CODED         ((uint8_t) 0x04)
#define SCANNER_PHYS_1M_AND_CODED  ((uint8_t) 0x05)

/* Values used for @p scan_mode param of @ref sl_bt_scanner_set_mode */
#define SCANNER_MODE_PASSIVE  ((uint8_t) 0x00)
#define SCANNER_MODE_ACTIVE   ((uint8_t) 0x01)

/* Scan report packet type mask and values */
#define SCAN_REPORT_PACKET_TYPE_MASK                           ((uint8_t) 0x07)
#define SCAN_REPORT_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED_ADV  ((uint8_t) 0x00)
#define SCAN_REPORT_TYPE_CONNECTABLE_UNDIRECTED_ADV            ((uint8_t) 0x01)
#define SCAN_REPORT_TYPE_SCANNABLE_UNDIRECTED_ADV              ((uint8_t) 0x02)
#define SCAN_REPORT_TYPE_UNDIRECTED_ADV                        ((uint8_t) 0x03)
#define SCAN_REPORT_TYPE_SCAN_RESPONSE                         ((uint8_t) 0x04)

/* Scan report packet type mask and values to indicate completeness */
#define SCAN_REPORT_COMPLETENESS_MASK   ((uint8_t) 0x60)
#define SCAN_REPORT_COMPLETE            ((uint8_t) 0x00)
#define SCAN_REPORT_INCOMPLETE_MORE     ((uint8_t) 0x20)
#define SCAN_REPORT_INCOMPLETE_NO_MORE  ((uint8_t) 0x40)

/* Scan report packet type flag that indicates extended advertising */
#define SCAN_REPORT_EXTENDED_PDUS_FLAG  ((uint8_t) 0x80)

/** @brief Maximum length of legacy advertisement data */
#define MAX_LEGACY_ADV_DATA_LEN 31

/** @brief Buffer size for combined advertisement and scan response data */
#define ADV_DATA_AND_SCAN_RESPONSE_BUF_SIZE 62

/* Range of NVM keys used for storing the original device addresses for each bonded device */
#define BONDED_DEVICE_ADDRESS_NVM_KEY_MIN ((uint16_t) 0x4800)
#define BONDED_DEVICE_ADDRESS_NVM_KEY_MAX ((uint16_t) 0x4FFF)

/**
 * @brief Scanning context used for active scanning
 *
 * When active scanning is used, we need to temporarily store the
 * advertisement data so that we can combine it with the scan response data
 * that may arrive in a separate event.
 */
typedef struct
{
  uint8_t ucScanMode;   /**< SL BT API scanning mode */
  BTBdaddr_t xAddress;  /**< Address of the advertiser that sent the stored data */
  int8_t cRssi;         /**< Signal strength indicator (RSSI) in the received data */
  uint8_t ucDataLength; /**< Length of the data stored or 0 if the context is empty */
  uint8_t ucAdvData[ADV_DATA_AND_SCAN_RESPONSE_BUF_SIZE];
} SlBtScanContext_t;

/**
 * @brief Scanning context instance
 *
 * The scanning context is allocated when scanning starts, and freed when scanning is ended.
 */
SlBtScanContext_t * pxScanContext = NULL;

/* Type of the API that the advertiser is using */
typedef enum
{
  SlBtHalAdvApiNone = 0, /**< Advertising is not in use */
  SlBtHalAdvApiBasic,    /**< The basic advertising API (pxStartAdv(), pxStopAdv(),
                              pxSetAdvData()) is used */
  SlBtHalAdvApiMultiAdv, /**< The MultiAdv*() API is in use */
} SlBtHalAdvApi_t;

/**
 * @brief Structure to collect the data of one application/adapterIf
 */
typedef struct
{
  SlBtBleHalClient_t xClient;   /**< Client UUID and handle */
  SlBtHalAdvApi_t xAdvApiType;  /**< Type of the advertisement API that's being used */
  uint8_t ucAdvSetHandle;       /**< SL BT API advertiser set handle */
  uint8_t ucAdvConnectableMode; /**< SL BT API advertiser connectable mode */
  int16_t sSetAdvPower;         /**< Power level that was set for advertising */
  bool bAdvActive;              /**< True when advertising is active */
} SlBtAdapterIf_t;

/**
 * @brief Head of the list of adapterIf contexts
 */
static SlBtAdapterIf_t * pxAdapterIfs = NULL;

/* Flag indicating a new pairing on the connection just happened. */
#define CONNECTION_FLAG_NEW_PAIRING    ((uint8_t) 0x01)

/* Valid range for connection interval. See sl_bt_api.h, function
 * sl_bt_connection_set_parameters() */
#define MIN_CONNECTION_INTERVAL ((uint16_t) 0x0006)
#define MAX_CONNECTION_INTERVAL ((uint16_t) 0x0c80)

/* Valid range for connection timeout. See sl_bt_api.h, function
 * sl_bt_connection_set_parameters() */
#define MIN_CONNECTION_TIMEOUT ((uint16_t) 0x000a)
#define MAX_CONNECTION_TIMEOUT ((uint16_t) 0x0c80)

/* Maximum value for slave latency. See sl_bt_api.h, function
 * sl_bt_connection_set_parameters() */
#define MAX_SLAVE_LATENCY ((uint16_t) 0x01f4)

/**
 * @brief Structure to save BT connection informations
 */
typedef struct
{
  uint8_t ucAdapterIf;        /**< ucAdapterIf of application which opened the connection */
  uint8_t ucConnectionHandle; /**< Handle of connection */
  uint8_t ucBondingHandle;    /**< The bonding handle of the remote device */
  uint8_t ucSecurityLevel;    /**< The security level of the connection */
  uint16_t usMinInterval;     /**< Minimum connection interval currently requested for this connection,
                                   or 0 if no local parameter update request is pending */
  uint16_t usMaxInterval;     /**< Maximum connection interval currently requested for this connection,
                                   or 0 if no local parameter update request is pending */
  BTBdaddr_t xRemoteAddress;  /**< Remote BT address used to identify this device in the BLE HAL API.
                                   For bonded devices the original address is stored in non-volatile
                                   memory and retrieved when the device reconnects. */
  uint8_t ucFlags;            /**< Flags currently set on this connection */
} SlBtConnections_t;

/**
 * @brief BT connection array contains BT address, connection handle values of open connections
 */
static SlBtConnections_t xBtConnections[SL_BT_CONFIG_MAX_CONNECTIONS] = { 0 };

