espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
/** @brief Callbacks registered in the call to @ref prvBleAdapterInit */
static const BTBleAdapterCallbacks_t * pxBleAdapterCallbacks = NULL;

/**
 * @brief Static random address used for advertisers
 *
 * This static random Bluetooth address is used by all advertisers that specify the
 * `BTAddrTypeStaticRandom` address type in their configuration. The address is generated when it is
 * first needed and remains unchanged until device reboot.
 */
static bd_addr xAdvStaticRandomAddr = { 0 };
static bool bHaveAdvStaticRandomAddr = false;

/**
 * @brief Structure to collect advertiser parameters used in SL BT API
 */
typedef struct
{
  uint32_t ulMinInterval;
  uint32_t ulMaxInterval;
  uint16_t usTimeout;
  int16_t  usRequestedPower;
  uint8_t  ucPrimaryPhy;   /* Uses values of enum gap_phy_type_t */
  uint8_t  ucSecondaryPhy; /* Uses values of enum gap_phy_type_t */
  uint8_t  ucChannelMap;
  uint8_t  ucAddressType;  /* Uses values of enum gap_address_type_t */
} SlBtAdvParams_t;

/**
 * @brief Convert Silabs security mode to a value of BTSecurityLevel_t type.
 */
static BTSecurityLevel_t prvConvertSecurityMode(sl_bt_connection_security_t ucSecurityMode)
{
  switch (ucSecurityMode)
  {
    case sl_bt_connection_mode1_level1:
      return eBTSecLevelNoSecurity;

    case sl_bt_connection_mode1_level2:
      return eBTSecLevelUnauthenticatedPairing;

    case sl_bt_connection_mode1_level3:
      return eBTSecLevelAuthenticatedPairing;

    case sl_bt_connection_mode1_level4:
      return eBTSecLevelSecureConnect;

    default:
      return eBTSecLevelNoSecurity;
  }
}

/**
 * @brief Save the newly established connection handle, address information and adapterIf
 *
 * @param[in] ucAdapterIf The adapterIf
 * @param[in] ucConnectionHandle The connection handle
 * @param[in] pxRemoteAddress Bluetooth address of the remote device
 *
 * @return Pointer to the SlBtConnections_t structure where the information is saved
 */
static SlBtConnections_t * prvSaveNewConnection( uint8_t ucAdapterIf,
                                                 uint8_t ucConnectionHandle,
                                                 uint8_t ucBondingHandle,
                                                 const BTBdaddr_t * pxRemoteAddress )
{
  SlBtConnections_t * pConnection = NULL;
  for ( uint8_t i = 0; i < SL_BT_CONFIG_MAX_CONNECTIONS; i ++ )
  {
    /* Find a free memory slot for new connection. */
    if ( (xBtConnections[i].ucAdapterIf == SL_BT_INVALID_IF_HANDLE) ||
         (xBtConnections[i].ucConnectionHandle == ucConnectionHandle) )
    {
      pConnection = &xBtConnections[i];
      break;
    }
  }
  if ( pConnection != NULL )
  {
    pConnection->ucAdapterIf = ucAdapterIf;
    pConnection->ucConnectionHandle = ucConnectionHandle;
    pConnection->ucBondingHandle = ucBondingHandle;
    pConnection->ucSecurityLevel = eBTSecLevelNoSecurity;
    pConnection->usMinInterval = 0; /* No parameter update request is pending yet */
    pConnection->usMaxInterval = 0;
    pConnection->ucFlags = 0;
    pConnection->xRemoteAddress = *pxRemoteAddress;
  }
  return pConnection;
}

/**
 * @brief Get the information of saved connection
 *
 * @param[in] ucConnectionHandle The connection handle
 *
 * @return Pointer of SlBtConnections_t structure where the connection is saved
 */
static SlBtConnections_t * prvGetConnection( uint8_t ucConnectionHandle )
{
  for ( uint8_t i = 0; i < SL_BT_CONFIG_MAX_CONNECTIONS; i ++ )
  {
    if ( (xBtConnections[i].ucAdapterIf != SL_BT_INVALID_IF_HANDLE) &&
         (xBtConnections[i].ucConnectionHandle == ucConnectionHandle) )
    {
      return &xBtConnections[i];
    }
  }
  return NULL;
}

/* Get pointer of BTBdaddr_t of the connection handle */
BTBdaddr_t * prvGetConnectionAddress( uint8_t ucConnectionHandle )
{
  SlBtConnections_t * pConnection =  prvGetConnection( ucConnectionHandle );
  if ( pConnection != NULL )
  {
    return &pConnection->xRemoteAddress;
  }
  return NULL;
}

/**
 * @brief Get the information of saved connection by the Bluetooth address
 *
 * @param[in] pxRemoteAddress Bluetooth address of the remote device
 *
 * @return Pointer of SlBtConnections_t structure where the connection is saved
 */
static SlBtConnections_t * prvGetConnectionByAddress( const BTBdaddr_t * pxRemoteAddress )
{
  if( pxRemoteAddress == NULL )
  {
    return NULL;
  }

  for( uint8_t i = 0; i < SL_BT_CONFIG_MAX_CONNECTIONS; i++ )
  {
    if ( ( xBtConnections[i].ucAdapterIf != SL_BT_INVALID_IF_HANDLE ) &&
         ( memcmp( xBtConnections[i].xRemoteAddress.ucAddress,
                   pxRemoteAddress->ucAddress,
                   sizeof( pxRemoteAddress->ucAddress ) ) == 0 ) )
    {
      return &xBtConnections[i];
    }
  }

  return NULL;
}

/* Get the connection handle by a Bluetooth device address. */
BTStatus_t prvGetConnectionHandle( const BTBdaddr_t * pxRemoteAddress, uint8_t *pucConnectionHandle )
{
  /* Find the connection */
  SlBtConnections_t * pxConnection = prvGetConnectionByAddress( pxRemoteAddress );
  if( pxConnection == NULL )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to find connection for pxRemoteAddress="LOG_BDADDR_FORMAT", status=%d",
                                    LOG_BTBDADDR_T_VALUE( pxRemoteAddress ), eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  *pucConnectionHandle = pxConnection->ucConnectionHandle;
  return eBTStatusSuccess;
}

/**
 * @brief Get the adapterIf context for the specified @p ucAdapterIf
 *
 * @param[in] ucAdapterIf The adapter interface handle
 *
 * @return Pointer to the adapterIf context, or NULL if ucAdapterIf was invalid
 */
static inline SlBtAdapterIf_t * prvGetAdapterIf( uint8_t ucAdapterIf )
{
  SlBtBleHalClient_t * pxClient =
    prvGetBleHalClientByHandle( ucAdapterIf, ( SlBtBleHalClient_t * ) pxAdapterIfs );
  return ( SlBtAdapterIf_t * ) pxClient;
}

/**
 * @brief Get the adapterIf context for the specified @p ucAdvSetHandle
 *
 * @param[in] ucAdvSetHandle Advertisement set handle
 *
 * @return Pointer to the adapterIf context, or NULL if no matching adapterIf was found
 */
static SlBtAdapterIf_t * prvGetAdapterIfByAdvSetHandle( uint8_t ucAdvSetHandle )
{
  /* Find the adapter context, if any, that has this advertiser set */
  SlBtAdapterIf_t * pxAdapterIf = pxAdapterIfs;
  while( pxAdapterIf != NULL )
  {
    if( (pxAdapterIf->xClient.ucHandle != SL_BT_INVALID_IF_HANDLE) &&
        (pxAdapterIf->ucAdvSetHandle != SL_BT_INVALID_ADVERTISING_SET_HANDLE) &&
        (pxAdapterIf->ucAdvSetHandle == ucAdvSetHandle) )
    {
      return pxAdapterIf;
    }

    pxAdapterIf = ( SlBtAdapterIf_t * ) pxAdapterIf->xClient.pxNext;
  }

