espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  return NULL;
}

/**
 * @brief Get the adapterIf context and create an advertiser set if not done yet
 *
 * @param[in] ucAdapterIf The adapter interface handle
 * @param[in] xAdvApiType The API type that the advertiser set will be used for
 * @param[out] ppxAdapterIf On success set, set to point to the adapterIf context
 *
 * @return eBTStatusSuccess on success, otherwise an error code
 */
static BTStatus_t prvGetAdapterIfWithAdvSet( uint8_t ucAdapterIf,
                                             SlBtHalAdvApi_t xAdvApiType,
                                             SlBtAdapterIf_t ** ppxAdapterIf )
{
  /* Get the adapterIf context */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIf( ucAdapterIf );
  if( pxAdapterIf == NULL )
  {
    return eBTStatusParamInvalid;
  }
  *ppxAdapterIf = NULL;

  /* If the adapter context is already reserved for use with another
   * advertisement API, return an error. */
  if( ( pxAdapterIf->xAdvApiType != SlBtHalAdvApiNone ) && ( pxAdapterIf->xAdvApiType != xAdvApiType ) )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "adapter has xAdvApiType=%d, requested xAdvApiType=%d",
                                    pxAdapterIf->xAdvApiType, xAdvApiType );
    return eBTStatusBusy;
  }

  /* If we don't yet have an advertiser set, create one now */
  if( pxAdapterIf->ucAdvSetHandle == SL_BT_INVALID_ADVERTISING_SET_HANDLE )
  {
    sl_status_t sl_status = sl_bt_advertiser_create_set( &pxAdapterIf->ucAdvSetHandle );
    if( sl_status != SL_STATUS_OK )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to create advertiser, sl_status=0x%x", sl_status );
      return prvSlStatusToBTStatus( sl_status );
    }

    /* Commit the context to the given API */
    pxAdapterIf->xAdvApiType = xAdvApiType;
  }

  *ppxAdapterIf = pxAdapterIf;
  return eBTStatusSuccess;
}

/* Advertisement PHY selection values specified in Bluetooth Core Specification
 * version 5.2, Volume 4, Part E, Section 7.8.53. */
#define ADVERTISEMENT_PHY_1M    ((uint8_t) 0x01)
#define ADVERTISEMENT_PHY_2M    ((uint8_t) 0x02)
#define ADVERTISEMENT_PHY_CODED ((uint8_t) 0x03)

/**
 * @brief Map a BLE Adapter API phy type to a gap_phy_type_t
 *
 * @param[in] ucPhy Phy selection of BLE Adapter API
 *
 * @return Corresponding gap_phy_type_t value
 */
static gap_phy_type_t prvBlePhyToSlGapPhyType( uint8_t ucPhy )
{
  /* Amazon FreeRTOS Bluetooth API does not specify the values used for the phy
   * selection, but seems to use value 0 in tests. We must assume that 0 means
   * default and any concrete values are the values used in the HCI standard
   * (Bluetooth Core Specification version 5.2, Volume 4, Part E, Section
   * 7.8.53). */
  gap_phy_type_t gapPhy = gap_1m_phy;
  switch( ucPhy )
  {
    case ADVERTISEMENT_PHY_1M:    gapPhy = gap_1m_phy;    break;
    case ADVERTISEMENT_PHY_2M:    gapPhy = gap_2m_phy;    break;
    case ADVERTISEMENT_PHY_CODED: gapPhy = gap_coded_phy; break;
    default:                      gapPhy = gap_1m_phy;    break;
  }

  return gapPhy;
}

/**
 * @brief Map a BLE Adapter API advertising event properties to
 * advertiser_connectable_mode_t
 *
 * @param[in] ucPhy Phy selection of BLE Adapter API
 *
 * @return Corresponding gap_phy_type_t value
 */
static BTStatus_t prvAdvEventPropsToSlAdvConnectableMode(
  BTAdvProperties_t usAdvEventProps,
  uint8_t * pucSlBtConnectableMode )
{
  BTStatus_t status = eBTStatusParamInvalid;
  switch ( usAdvEventProps )
  {
    case BTAdvInd:
      /* Undirected connectable scannable */
      *pucSlBtConnectableMode = sl_bt_advertiser_connectable_scannable;
      status = eBTStatusSuccess;
      break;

    case BTAdvDirectInd:
      /* Directed connectable. Not supported by Silicon Labs stack. */
      status = eBTStatusUnsupported;
      break;

    case BTAdvNonconnInd:
      /* Non-connectable non-scannable */
      *pucSlBtConnectableMode = sl_bt_advertiser_non_connectable;
      status = eBTStatusSuccess;
      break;

    default:
      status = eBTStatusParamInvalid;
      break;
  }

  return status;
}

/**
 * @brief Array to map BT_HAL_BLE_ADV_TX_PWR_* index to SL BT API power value
 *
 * TX power is represented in the SL BT API with units of 0.1 dBm.
 */
static const int16_t xTxPowerLevels[] =
{
  -210, /* BT_HAL_BLE_ADV_TX_PWR_ULTRA_LOW,  -21 dBm */
  -150, /* BT_HAL_BLE_ADV_TX_PWR_LOW,        -15 dBm */
   -70, /* BT_HAL_BLE_ADV_TX_PWR_MEDIUM,      -7 dBm */
    40, /* BT_HAL_BLE_ADV_TX_PWR_HIGH,         4 dBm */
    90, /* BT_HAL_BLE_ADV_TX_PWR_ULTRA_HIGH,   9 dBm */
};

/* Map a BLE Adapter API power level index to SL BT API power value */
BTStatus_t prvTxPowerIndexToSlBtPower( uint8_t ucTxPower,
                                       int16_t * psSlBtPower )
{
  BTStatus_t status = eBTStatusParamInvalid;
  if( ucTxPower < (sizeof(xTxPowerLevels) / sizeof(xTxPowerLevels[0])) )
  {
    *psSlBtPower = xTxPowerLevels[ucTxPower];
    status = eBTStatusSuccess;
  }
  else
  {
    /* Out of range, use the lowest power level */
    status = eBTStatusParamInvalid;
    *psSlBtPower = xTxPowerLevels[0];
  }

  return status;
}

/**
 * @brief Registers a BLE application with the stack.
 *
 * This function implements pxRegisterBleApp function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvRegisterBleApp( BTUuid_t * pxAppUuid )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "pxAppUuid=%p", pxAppUuid );

  /* Register using the common mechanism */
  SlBtAdapterIf_t * pxAdapterIf = NULL;
  BTStatus_t status = prvRegisterBleHalClient( pxAppUuid,
                                               ( SlBtBleHalClient_t ** ) &pxAdapterIfs,
                                               SL_BT_HAL_MAX_BLE_APPS,
                                               sizeof(*pxAdapterIfs),
                                               ( SlBtBleHalClient_t ** ) &pxAdapterIf );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "status=%d", status );
    return status;
  }

  /* Initialize the context */
  pxAdapterIf->ucAdvSetHandle = SL_BT_INVALID_ADVERTISING_SET_HANDLE;
  pxAdapterIf->bAdvActive = false;

  /* Call the application */
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxRegisterBleAdapterCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxRegisterBleAdapterCb", "ucHandle=0x%x",
                                  pxAdapterIf->xClient.ucHandle );
    pxBleAdapterCallbacks->pxRegisterBleAdapterCb( eBTStatusSuccess,
                                                   pxAdapterIf->xClient.ucHandle,
                                                   pxAppUuid );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxRegisterBleAdapterCb" );
  }

