espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d, ucAdapterIf=%d",
                                  eBTStatusSuccess, (int) pxAdapterIf->xClient.ucHandle );
  return eBTStatusSuccess;
}

/**
 * @brief Unregister a BLE application from the stack.
 *
 * This function implements pxUnregisterBleApp function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvUnregisterBleApp( uint8_t ucAdapterIf )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "ucAdapterIf=%d", (int) ucAdapterIf );

  /* Get the adapter context */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIf( ucAdapterIf );
  if( !pxAdapterIf )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Release resources */
  BTStatus_t status = eBTStatusSuccess;
  if( pxAdapterIf->ucAdvSetHandle != SL_BT_INVALID_ADVERTISING_SET_HANDLE )
  {
    sl_status_t sl_status = sl_bt_advertiser_delete_set( pxAdapterIf->ucAdvSetHandle );
    if( sl_status != SL_STATUS_OK )
    {
      status = prvSlStatusToBTStatus( sl_status );
    }
    pxAdapterIf->ucAdvSetHandle = SL_BT_INVALID_ADVERTISING_SET_HANDLE;
  }
  pxAdapterIf->xClient.ucHandle = SL_BT_INVALID_IF_HANDLE;

  /* Free the context */
  prvFreeBleHalClient( ( SlBtBleHalClient_t ** ) &pxAdapterIfs,
                       ( SlBtBleHalClient_t * ) pxAdapterIf );

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", status );
  return status;
}

/**
 * @brief Initializes the interface and provides callback routines.
 *
 * This function implements pxBleAdapterInit function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvBleAdapterInit( const BTBleAdapterCallbacks_t * pxCallbacks )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "pxCallbacks=%p", pxCallbacks );

  /* Free all adapters on initialisation */
  while( pxAdapterIfs != NULL )
  {
    prvFreeBleHalClient( ( SlBtBleHalClient_t ** ) &pxAdapterIfs,
                       ( SlBtBleHalClient_t * ) pxAdapterIfs );
  }

  BTStatus_t status = eBTStatusParamInvalid;
  if( pxCallbacks )
  {
    pxBleAdapterCallbacks = pxCallbacks;
    status = eBTStatusSuccess;
  }

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", status );
  return status;
}

/**
 * @brief Get Bluetooth LE Adapter property of 'type'.
 *
 * This function implements pxGetBleAdapterProperty function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvGetBleAdapterProperty( BTBlePropertyType_t xType )
{
  /* This function is not supported */
  (void) xType;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Set Bluetooth LE Adapter property of 'type'.
 *
 * This function implements pxSetBleAdapterProperty function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvSetBleAdapterProperty( const BTBleProperty_t * pxProperty )
{
  /* This function is not supported */
  (void) pxProperty;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Get all Remote Device properties.
 *
 * This function implements pxGetallBleRemoteDeviceProperties function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvGetallBleRemoteDeviceProperties( BTBdaddr_t * pxRremoteAddr )
{
  /* This function is not supported */
  (void) pxRremoteAddr;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Get Remote Device property of 'type'.
 *
 * This function implements pxGetBleRemoteDeviceProperty function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvGetBleRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                                 BTBleProperty_t xType )
{
  /* This function is not supported */
  (void) pxRemoteAddr;
  (void) xType;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Set Remote Device property of 'type' .
 *
 * This function implements pxSetBleRemoteDeviceProperty function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvSetBleRemoteDeviceProperty( BTBdaddr_t * pxRemoteAddr,
                                                 const BTBleProperty_t * pxProperty )
{
  /* This function is not supported */
  (void) pxRemoteAddr;
  (void) pxProperty;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Start or stop LE device scanning.
 *
 * This function implements pxScan function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvScan( bool bStart )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "bStart=%d", (int) bStart );

  /* Start or stop depending on the ask */
  sl_status_t sl_status = SL_STATUS_FAIL;
  if( bStart )
  {
    /* Allocate the scanning context if we don't have it already */
    if( pxScanContext == NULL )
    {
      pxScanContext = sl_malloc( sizeof( *pxScanContext ) );
      if( pxScanContext == NULL )
      {
        SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to allocate context, status=%d", eBTStatusNoMem );
        return eBTStatusNoMem;
      }
      memset( pxScanContext, 0, sizeof( *pxScanContext ) );
    }

    /* The BLE HAL API does not provide a method for choosing the scanning mode.
    We use active scanning always. */
    pxScanContext->ucScanMode = SCANNER_MODE_ACTIVE;

    /* Set the scanning mode and start scanning */
    sl_status = sl_bt_scanner_set_mode( SCANNER_PHYS_1M, pxScanContext->ucScanMode );
    if( sl_status == SL_STATUS_OK )
    {
      sl_status = sl_bt_scanner_start( SCANNER_PHYS_1M,
                                       sl_bt_scanner_discover_observation );
    }

    /* If we failed to start, free the scanning context */
    if( sl_status != SL_STATUS_OK )
    {
      sl_free( pxScanContext );
      pxScanContext = NULL;
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to start, sl_status=0x%x", sl_status );
      return prvSlStatusToBTStatus( sl_status );
    }
  }
  else
  {
    /* When scanner is stopped, always free the scanning context to make sure we
    stop delivering scan reports to the app even if the stopping in the stack
    somehow fails. */
    if( pxScanContext != NULL )
    {
      sl_free( pxScanContext );
      pxScanContext = NULL;
    }

    /* Stop the scanner in the Bluetooth stack */
    sl_status = sl_bt_scanner_stop( );
    if( sl_status != SL_STATUS_OK )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to stop, sl_status=0x%x", sl_status );
      return prvSlStatusToBTStatus( sl_status );
    }
  }

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", eBTStatusSuccess );
  return eBTStatusSuccess;
}

/**
 * @brief Create a connection to a remote LE or dual-mode device.
 *
 * This function implements pxConnect function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvConnect( uint8_t ucAdapterIf,
                              const BTBdaddr_t * pxBdAddr,
                              bool bIsDirect,
                              BTTransport_t ulTransport )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) pxBdAddr;
  (void) bIsDirect;
  (void) ulTransport;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Disconnect a remote device or cancel a pending connection.
 *
 * This function implements pxDisconnect function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvDisconnect( uint8_t ucAdapterIf,
                                 const BTBdaddr_t * pxBdAddr,
                                 uint16_t usConnId )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "ucAdapterIf=%d, usConnId=%PRIu16",
                                  (int) ucAdapterIf, usConnId );

