espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  (void) pxBdAddr;
  /* Get the adapterIf context */
  BTStatus_t status = eBTStatusParamInvalid;
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIf( ucAdapterIf );
  if( pxAdapterIf )
  {
    status = eBTStatusSuccess;
    sl_status_t sl_status = sl_bt_connection_close( usConnId );
    if( sl_status != SL_STATUS_OK )
    {
      status = prvSlStatusToBTStatus( sl_status );
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to close, status=%d", status );
      return status;
    }
  }

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", eBTStatusSuccess );
  return status;
}

/**
 * @brief Start advertisements to listen for incoming connections.
 *
 * This function implements pxStartAdv function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvStartAdv( uint8_t ucAdapterIf )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "ucAdapterIf=%d", (int) ucAdapterIf );

  /* Get the adapterIf context and create its advertiser set if necessary */
  SlBtAdapterIf_t * pxAdapterIf = NULL;
  BTStatus_t status = prvGetAdapterIfWithAdvSet( ucAdapterIf, SlBtHalAdvApiBasic, &pxAdapterIf );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to get adapter with advertiser, status=%d", status );
    return status;
  }

  /* Start advertising with user-defined data */
  sl_status_t sl_status = sl_bt_advertiser_start( pxAdapterIf->ucAdvSetHandle,
                                                  sl_bt_advertiser_user_data,
                                                  pxAdapterIf->ucAdvConnectableMode );
  if( sl_status != SL_STATUS_OK )
  {
    status = prvSlStatusToBTStatus( sl_status );
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to start, status=%d", status );
    return status;
  }

  /* On success, remember the status and give the callback */
  pxAdapterIf->bAdvActive = true;
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxAdvStatusCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxAdvStatusCb", "ucHandle=0x%x", pxAdapterIf->xClient.ucHandle );
    pxBleAdapterCallbacks->pxAdvStatusCb( eBTStatusSuccess,
                                          pxAdapterIf->xClient.ucHandle,
                                          true );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxAdvStatusCb" );
  }

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", status );
  return status;
}

/**
 * @brief Stop advertisements to listen for incoming connections.
 *
 * This function implements pxStopAdv function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvStopAdv( uint8_t ucAdapterIf )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "ucAdapterIf=%d", (int) ucAdapterIf );

  /* Get the adapterIf context */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIf( ucAdapterIf );
  if( !pxAdapterIf )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to get adapter, status=%d",
                                    eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Stop advertising if we have a handle and are currently active */
  BTStatus_t status = eBTStatusSuccess;
  if( (pxAdapterIf->ucAdvSetHandle != SL_BT_INVALID_ADVERTISING_SET_HANDLE) &&
      pxAdapterIf->bAdvActive )
  {
    sl_status_t sl_status = sl_bt_advertiser_stop( pxAdapterIf->ucAdvSetHandle );
    if( sl_status != SL_STATUS_OK )
    {
      SILABS_BLE_LOG_PRINT_ERROR( "failed to stop advertiser, sl_status=0x%x", sl_status );
      status = prvSlStatusToBTStatus( sl_status );
    }
  }

  pxAdapterIf->bAdvActive = false;

  /* Give the callback */
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxAdvStatusCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxAdvStatusCb", "ucHandle=0x%x", pxAdapterIf->xClient.ucHandle );
    pxBleAdapterCallbacks->pxAdvStatusCb( eBTStatusSuccess,
                                          pxAdapterIf->xClient.ucHandle,
                                          false );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxAdvStatusCb" );
  }

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", status );
  return status;
}

/**
 * @brief Delete the advertiser set of a multi-advertiser
 *
 * @param[in] pxAdapterIf Adapter IF context of the multi-advertiser
 */
static void prvDeleteMultiAdvertiserAdvSet( SlBtAdapterIf_t * pxAdapterIf )
{
  /* Delete the advertiser set, if any */
  if( ( pxAdapterIf->ucAdvSetHandle != SL_BT_INVALID_ADVERTISING_SET_HANDLE ) &&
      ( pxAdapterIf->xAdvApiType == SlBtHalAdvApiMultiAdv ) )
  {
    /* We ignore any errors here, as there's nothing we could do to recover. */
    sl_status_t sl_status = sl_bt_advertiser_delete_set( pxAdapterIf->ucAdvSetHandle );
    (void) sl_status;
    pxAdapterIf->ucAdvSetHandle = SL_BT_INVALID_ADVERTISING_SET_HANDLE;
    pxAdapterIf->xAdvApiType = SlBtHalAdvApiNone;
    pxAdapterIf->bAdvActive = false;

    /* Call the application */
    if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxMultiAdvDisableCb )
    {
      SILABS_BLE_LOG_CB_CALL_DEBUG( "pxMultiAdvDisableCb", "ucHandle=0x%x", pxAdapterIf->xClient.ucHandle );
      pxBleAdapterCallbacks->pxMultiAdvDisableCb( pxAdapterIf->xClient.ucHandle, eBTStatusSuccess );
      SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxMultiAdvDisableCb" );
    }
  }
}

/**
 * @brief Handle the implicit stopping of an advertiser
 *
 * This function is called when advertising is stopped implicitly without
 * application action, for example when the advertisiment timed out, or was
 * stopped because a connection was established. This function checks the type
 * of the API that was being used and handles the implicit stopping
 * approriately.
 *
 * @param[in] pxAdapterIf Adapter IF context of the advertiser
 */
static void prvStopAdvertiserImplicitly( SlBtAdapterIf_t * pxAdapterIf )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "ucAdapterIf=%d", ( int ) pxAdapterIf->xClient.ucHandle );

  /* If the app is advertising with the basic advertising APIs, stop it */
  if( ( pxAdapterIf->xAdvApiType == SlBtHalAdvApiBasic ) && ( pxAdapterIf->bAdvActive ) )
  {
    /* Stopping the basic advertiser will also make the callback to the app */
    prvStopAdv( pxAdapterIf->xClient.ucHandle );
  }

  /* If the context is used by a multi-advertiser, delete the advertiser */
  if( ( pxAdapterIf->xAdvApiType == SlBtHalAdvApiMultiAdv ) )
  {
    /* Deleting the multi-advertiser will also make the callback to the app */
    prvDeleteMultiAdvertiserAdvSet( pxAdapterIf );
  }

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "%s", "" );
}

/**
 * @brief Triggered when advertiser has timed out
 */
static void prvOnAdvertiserTimeout( sl_bt_evt_advertiser_timeout_t * pxEvent )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "advertiser=%d", ( int ) pxEvent->handle );


