espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  /* Get the adapterIf context */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIfByAdvSetHandle( pxEvent->handle );
  if( pxAdapterIf )
  {
    /* Handle the implicit stop of the advertiser */
    prvStopAdvertiserImplicitly( pxAdapterIf );
  }

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "%s", "" );
}

/**
 * @brief Append data to the scanning context
 *
 * @param[out] pxScanContext Scan context to append to
 * @param[in] pxScanReport Scan report to read data from
 */
static void prvAppendScanReportData( SlBtScanContext_t * pxScanContext,
                                     sl_bt_evt_scanner_scan_report_t * pxScanReport )
{
  /* Make sure we never overflow the buffer */
  size_t xSpaceRemaining = 0;
  if( sizeof( pxScanContext->ucAdvData ) > pxScanContext->ucDataLength )
  {
    xSpaceRemaining = sizeof( pxScanContext->ucAdvData ) - pxScanContext->ucDataLength;
  }
  uint8_t ucBytesToCopy = pxScanReport->data.len;
  if( ucBytesToCopy > xSpaceRemaining )
  {
    ucBytesToCopy = xSpaceRemaining;
  }

  /* Append the data */
  memcpy( &pxScanContext->ucAdvData[pxScanContext->ucDataLength],
          pxScanReport->data.data,
          ucBytesToCopy );
  pxScanContext->ucDataLength += ucBytesToCopy;

  /* If the buffer is not full, ensure termination with a 0 byte */
  if( pxScanContext->ucDataLength < sizeof( pxScanContext->ucAdvData ) )
  {
    pxScanContext->ucAdvData[pxScanContext->ucDataLength] = 0;
  }

  /* Store the RSSI and the address */
  pxScanContext->cRssi = pxScanReport->rssi;
  memcpy( pxScanContext->xAddress.ucAddress,
          pxScanReport->address.addr,
          sizeof( pxScanContext->xAddress.ucAddress ) );
}

/**
 * @brief Send data to application and clear the scanning context
 *
 * @param[in,out] pxScanContext Scan context to send and clear
 */
static void prvSendAndClearScanReportData( SlBtScanContext_t * pxScanContext )
{
  /* Send the data to the app */
  if( ( pxBleAdapterCallbacks != NULL ) && ( pxBleAdapterCallbacks->pxScanResultCb != NULL ) )
  {
    pxBleAdapterCallbacks->pxScanResultCb( &pxScanContext->xAddress,
                                           (uint32_t) pxScanContext->cRssi, /* RSSI is reported in a uint32_t */
                                           pxScanContext->ucAdvData );
  }

  /* Clear the data */
  memset( &pxScanContext->xAddress, 0, sizeof( pxScanContext->xAddress ) );
  memset( &pxScanContext->ucAdvData, 0, sizeof( pxScanContext->ucAdvData ) );
  pxScanContext->ucDataLength = 0;
}

/**
 * @brief Triggered when a scan report event is received
 */
static void prvOnScanReportEvent( sl_bt_evt_scanner_scan_report_t * pxScanReport )
{
  /* If the application has no callback or is not actively scanning, we can
  ignore the event */
  if( ( pxBleAdapterCallbacks == NULL ) ||
      ( pxBleAdapterCallbacks->pxScanResultCb == NULL ) ||
      ( pxScanContext == NULL ) )
  {
    return;
  }

  /* The BLE HAL API is only prepared for legacy advertising. We ignore extended
  advertising or data that is too long or incomplete. */
  if( ( pxScanReport->packet_type & SCAN_REPORT_EXTENDED_PDUS_FLAG ) ||
      ( pxScanReport->data.len > MAX_LEGACY_ADV_DATA_LEN ) ||
      ( ( pxScanReport->packet_type & SCAN_REPORT_COMPLETENESS_MASK ) != SCAN_REPORT_COMPLETE ) )
  {
    return;
  }

  /* If active scanning is being used, we need to evaluate whether to store
  or forward the data immediately */
  if( pxScanContext->ucScanMode == SCANNER_MODE_ACTIVE )
  {
    /* See if the scan report we have is a scan response for the same device
    that we already have advertisement data from */
    uint8_t ucPacketType = pxScanReport->packet_type & SCAN_REPORT_PACKET_TYPE_MASK;
    if( ( ucPacketType == SCAN_REPORT_TYPE_SCAN_RESPONSE ) &&
        ( pxScanContext->ucDataLength > 0 ) &&
        ( memcmp( pxScanContext->xAddress.ucAddress,
                  pxScanReport->address.addr,
                  sizeof( pxScanContext->xAddress.ucAddress ) ) == 0 ) )
    {
      /* Append and send to the app */
      prvAppendScanReportData( pxScanContext, pxScanReport );
      prvSendAndClearScanReportData( pxScanContext );
      return;
    }

    /* Data was not appended, so this is not continuation of previous data.
    If we already have previously received data, send and clear that. */
    if( pxScanContext->ucDataLength > 0 )
    {
      prvSendAndClearScanReportData( pxScanContext );
    }

    /* If the scan report is scannable advertisement, the Bluetooth stack
    will send a scan request and we may later receive a scan response that
    we need to append to the advertisement data. */
    if( ( ucPacketType == SCAN_REPORT_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED_ADV ) ||
        ( ucPacketType == SCAN_REPORT_TYPE_SCANNABLE_UNDIRECTED_ADV ) )
    {
      /* Advertisement is scannable. Store the advertisement data. */
      prvAppendScanReportData( pxScanContext, pxScanReport );
      return;
    }

    /* The event is one that should be reported immediately. Continue to
    reporting it below. */
  }

  /* The BLE HAL API does not take the length of the advertisement data. It
  seems to assume that the data ends with an item that is 0 bytes long, i.e.
  that the first byte after the advertisement items is 0. We must take a
  copy so that we can ensure that termination. We have already verified the
  data size above, so this is guaranteed to fit in the buffer. We borrow the
  buffer for the copy but don't mean to store this event as we deliver it
  immediately. Make sure the stored length is cleared. */
  pxScanContext->ucDataLength = 0;
  memcpy( pxScanContext->ucAdvData, pxScanReport->data.data, pxScanReport->data.len );
  pxScanContext->ucAdvData[pxScanReport->data.len] = 0;
  pxBleAdapterCallbacks->pxScanResultCb( (BTBdaddr_t *) &pxScanReport->address,
                                         (uint32_t) pxScanReport->rssi, /* RSSI is reported in a uint32_t */
                                         pxScanContext->ucAdvData );
}

/**
 * @brief Map a bonding handle to an NVM key
 *
 * @param[in] ucBondingHandle The bonding handle
 *
 * @return The NVM key used to store information of this bonding
 */
static inline uint16_t prvBondingHandleToNvmKey( uint8_t ucBondingHandle )
{
  uint16_t usNvmKey = BONDED_DEVICE_ADDRESS_NVM_KEY_MIN + ucBondingHandle;
  return usNvmKey;
}

/**
 * @brief Save the address of a bonded device to non-volatile memory
 *
 * @param[in] ucBondingHandle The bonding handle
 * @param[in] pxBdAddr The Bluetooth address in the original connection
 *
 * @return eBTStatusSuccess on success, otherwise an error code
 */
static BTStatus_t prvSaveBondedDeviceAddress( uint8_t ucBondingHandle,
                                              const BTBdaddr_t * pxBdAddr )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "ucBondingHandle=%u, pxBdAddr="LOG_BDADDR_FORMAT,
                                  ( unsigned ) ucBondingHandle,
                                  LOG_BTBDADDR_T_VALUE( pxBdAddr ) );

