espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  sl_status_t sl_status = sl_bt_nvm_save( prvBondingHandleToNvmKey( ucBondingHandle ),
                                          sizeof( *pxBdAddr ),
                                          ( uint8_t * ) pxBdAddr );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_nvm_save failed, sl_status=0x%x", sl_status );
    return prvSlStatusToBTStatus( sl_status );
  }

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", eBTStatusSuccess );
  return eBTStatusSuccess;
}

/* Read the address of a bonded device, if any, from non-volatile memory */
BTStatus_t prvLoadBondedDeviceAddress( uint8_t ucBondingHandle,
                                       BTBdaddr_t * pxBdAddr )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "ucBondingHandle=%u", ( unsigned ) ucBondingHandle );

  size_t xExpectedLen = sizeof( *pxBdAddr );
  size_t xValueLen = 0;
  sl_status_t sl_status = sl_bt_nvm_load( prvBondingHandleToNvmKey( ucBondingHandle ),
                                          xExpectedLen,
                                          &xValueLen,
                                          ( uint8_t * ) pxBdAddr );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_nvm_load failed, sl_status=0x%x", sl_status );
    return prvSlStatusToBTStatus( sl_status );
  }
  if( xValueLen < xExpectedLen )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_nvm_load returned %u bytes, expected %u",
                                    ( unsigned ) xValueLen, ( unsigned ) xExpectedLen );
    return eBTStatusFail;
  }

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d, pxBdAddr="LOG_BDADDR_FORMAT,
                                 eBTStatusSuccess,
                                 LOG_BTBDADDR_T_VALUE( pxBdAddr ) );
  return eBTStatusSuccess;
}

/**
 * @brief Triggered when a new connection has been opened
 */
static void prvOnConnectionOpened( sl_bt_evt_connection_opened_t * pxEvent )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "advertiser=%d, connection=%d, bonding=%d",
                                  ( int ) pxEvent->advertiser,
                                  ( int ) pxEvent->connection,
                                  ( int ) pxEvent->bonding);

  /* Get the adapterIf context */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIfByAdvSetHandle( pxEvent->advertiser );
  if( !pxAdapterIf )
  {
    SILABS_BLE_LOG_FUNC_EXIT_INFO( "No adapter for advertiser=%d", ( int ) pxEvent->advertiser );
    return;
  }

  /* If the device was bonded, load the original address that it connected with */
  BTBdaddr_t xRemoteAddr;
  BTStatus_t xAddressStatus = eBTStatusNotReady;
  if( pxEvent->bonding != SL_BT_INVALID_BONDING_HANDLE )
  {
    xAddressStatus = prvLoadBondedDeviceAddress( pxEvent->bonding, &xRemoteAddr );
  }

  /* If we didn't already get an address from a stored bonding, use the adress
  the device connected with on this connection */
  if( xAddressStatus != eBTStatusSuccess )
  {
    memcpy( xRemoteAddr.ucAddress, &pxEvent->address, sizeof( xRemoteAddr.ucAddress ) );
  }

  /* Save the new connection before callback */
  prvSaveNewConnection( pxAdapterIf->xClient.ucHandle,
                        pxEvent->connection,
                        pxEvent->bonding,
                        &xRemoteAddr );

  /* Call the application */
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxOpenCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxOpenCb", "connection=%d, ucHandle=0x%x, xRemoteAddr="LOG_BDADDR_FORMAT,
                                 ( int ) pxEvent->connection,
                                 pxAdapterIf->xClient.ucHandle,
                                 LOG_BTBDADDR_T_VALUE(&xRemoteAddr));
    pxBleAdapterCallbacks->pxOpenCb( pxEvent->connection,
                                     eBTGattStatusSuccess,
                                     pxAdapterIf->xClient.ucHandle,
                                     &xRemoteAddr );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxOpenCb" );
  }

  /* Let the GATT Server call the corresponding callback */
  prvGattServerOpenConnectionEventCb( pxEvent->connection, &xRemoteAddr );

  /* Handle the implicit stop of the advertiser */
  prvStopAdvertiserImplicitly( pxAdapterIf );

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", eBTStatusSuccess );
}

/**
 * @brief Handle a new pairing event.
 *
 */
static void prvOnNewPairingEvent( SlBtConnections_t *pConnection )
{
  if( ( pConnection->ucFlags & CONNECTION_FLAG_NEW_PAIRING ) != 0 )
  {
    pConnection->ucFlags &= ~CONNECTION_FLAG_NEW_PAIRING;

    /* If the device was bonded, save the address that it connected with */
    if( pConnection->ucBondingHandle != SL_BT_INVALID_BONDING_HANDLE )
    {
      /* We ignore any errors from saving the address. If we failed, we
      won't be able to report the same address in future connections, but
      there's no need to fail this connection. */
      prvSaveBondedDeviceAddress( pConnection->ucBondingHandle,
                                  &pConnection->xRemoteAddress );
    }

    prvBtHalManagerOnNewPairingEvent( pConnection->ucBondingHandle,
                                      &pConnection->xRemoteAddress,
                                      pConnection->ucSecurityLevel);
  }
  else
  {
    pConnection->ucFlags |= CONNECTION_FLAG_NEW_PAIRING;
  }
}

/**
 * @brief Triggered when parameters on a connection has changed
 *
 * See @ref prvOnBonded for new pairing detection and handling
 */
static void prvOnConnectionParameters( sl_bt_evt_connection_parameters_t * pxEvent )
{
  SlBtConnections_t * pConnection = prvGetConnection( pxEvent->connection );
  if( !pConnection )
  {
    return;
  }

  /* If the change was originated by the peer, we won't have an active
  connection parameter update request pending. In this case we'll default to
  reporting min and max with the same value as the selected interval, as we
  don't have the actual min and max that the peer requested. */
  uint16_t usMinInterval = pxEvent->interval;
  uint16_t usMaxInterval = pxEvent->interval;
  if( ( pConnection->usMinInterval != 0 ) &&
      ( pConnection->usMaxInterval != 0 ) )
  {
    /* A local request was pending. Use the min and max range that was stored
    and clear the values to indicate the request is no longer pending. */
    usMinInterval = pConnection->usMinInterval;
    usMaxInterval = pConnection->usMaxInterval;
    pConnection->usMinInterval = 0;
    pConnection->usMaxInterval = 0;
  }

  /* Report the parameter update to the application */
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxConnParameterUpdateCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxConnParameterUpdateCb", "xRemoteAddress="LOG_BDADDR_FORMAT", "
                                  "ulMinInterval=%u, ulMaxInterval=%u, latency=%u, interval=%u, timeout=%u",
                                  LOG_BTBDADDR_T_VALUE( &pConnection->xRemoteAddress ),
                                  ( unsigned ) usMinInterval,
                                  ( unsigned ) usMaxInterval,
                                  ( unsigned ) pxEvent->latency,
                                  ( unsigned ) pxEvent->interval,
                                  ( unsigned ) pxEvent->timeout );
    pxBleAdapterCallbacks->pxConnParameterUpdateCb( eBTStatusSuccess,
                                                    &pConnection->xRemoteAddress,
                                                    usMinInterval,
                                                    usMaxInterval,
                                                    pxEvent->latency,
                                                    pxEvent->interval,
                                                    pxEvent->timeout );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxConnParameterUpdateCb" );
  }

  /* Check if this is a new pairing. See @ref prvOnBonded for the algorithm */
  BTSecurityLevel_t xNewSecurityLevel = prvConvertSecurityMode( pxEvent->security_mode );
  bool bNewPairing =
    ( pConnection->ucSecurityLevel == eBTSecLevelNoSecurity &&
      xNewSecurityLevel > eBTSecLevelNoSecurity );

