espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  if( bNewPairing )
  {
    pConnection->ucSecurityLevel = xNewSecurityLevel;
    prvOnNewPairingEvent( pConnection );
  }
}

/**
 * @brief Triggered when a connection has been closed
 */
static void prvOnConnectionClosed( sl_bt_evt_connection_closed_t * pxEvent )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "connection=%d", ( int ) pxEvent->connection);

  SlBtConnections_t * pConnection = prvGetConnection( pxEvent->connection );
  if ( pConnection != NULL )
  {
    /* Give the app the callback */
    if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxCloseCb )
    {
      SILABS_BLE_LOG_CB_CALL_DEBUG( "pxCloseCb", "connection=%d, event->reason=%d, ucHandle=0x%x, xRemoteAddress="LOG_BDADDR_FORMAT,
                                   ( int ) pxEvent->connection,
                                   ( int ) pxEvent->reason,
                                   pConnection->ucAdapterIf,
                                   LOG_BTBDADDR_T_VALUE(&pConnection->xRemoteAddress));
      pxBleAdapterCallbacks->pxCloseCb( pxEvent->connection,
                                        prvSlStatusToBTGattStatus(pxEvent->reason),
                                        pConnection->ucAdapterIf,
                                        &pConnection->xRemoteAddress );
      SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxCloseCb" );
    }

    SILABS_BLE_LOG(SILABS_BLE_LOG_DEBUG,
                       SILABS_BLE_HAL,
                       "%s: connection closed", __func__);

    /* Let the GATT Server call the corresponding callback */
    prvGattServerCloseConnectionEventCb( pxEvent->connection, &pConnection->xRemoteAddress );

    /* Delete the saved connection after callback */
    memset( pConnection, 0, sizeof( SlBtConnections_t ) );
    pConnection->ucAdapterIf = SL_BT_INVALID_IF_HANDLE;
  }

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", eBTStatusSuccess );
}

/**
 * @brief Triggered when a new pairing completes.
 *
 * Algorithm of detecting a new pairing and fetching all necessary data
 * required by BTPairingStateChangedCallback_t:
 *
 *   1) When sl_bt_evt_connection_opened event arrives, set the security level
 *   to 0 and update the bonding handle value in cache.
 *
 *   2) When sl_bt_evt_sm_bonded event arrives, update the bonding handle in
 *   cache. If new-paired flag is not set, set the flag. Otherwise, clear the
 *   flag and call prvBtHalManagerOnNewPairingEvent.
 *
 *   3) When sl_bt_evt_connection_parameters arrives, if security level increases
 *   from 0, and if either the bonding handle in cache is invalid bonding or
 *   new-paired flag is already set, this is a new pairing. In this case,
 *   update the security level in cache. If new-paired flag is not set, set the
 *   flag. Otherwise, clear the flag and call prvBtHalManagerOnNewPairingEvent.
 */
static void prvOnBonded( sl_bt_evt_sm_bonded_t * pxEvent )
{
  SlBtConnections_t * pConnection = prvGetConnection( pxEvent->connection );
  if( pConnection )
  {
    pConnection->ucBondingHandle = pxEvent->bonding;
    prvOnNewPairingEvent( pConnection );
  }
}

/**
 * @brief Request RSSI for a given remote device.
 *
 * This function implements pxReadRemoteRssi function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvReadRemoteRssi( uint8_t ucAdapterIf,
                                     const BTBdaddr_t * pxBdAddr )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) pxBdAddr;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Setup scan filter params.
 *
 * This function implements pxScanFilterParamSetup function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvScanFilterParamSetup( BTGattFiltParamSetup_t xFiltParam )
{
  /* This function is not supported */
  (void) xFiltParam;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Configure a scan filter condition.
 *
 * This function implements pxScanFilterAddRemove function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvScanFilterAddRemove( uint8_t ucAdapterIf,
                                          uint32_t ulAction,
                                          uint32_t ulFiltType,
                                          uint32_t ulFiltIndex,
                                          uint32_t ulCompanyId,
                                          uint32_t ulCompanyIdMask,
                                          const BTUuid_t * pxUuid,
                                          const BTUuid_t * pxUuidMask,
                                          const BTBdaddr_t * pxBdAddr,
                                          char cAddrType,
                                          size_t xDataLen,
                                          char * pcData,
                                          size_t xMaskLen,
                                          char * pcMask )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) ulAction;
  (void) ulFiltType;
  (void) ulFiltIndex;
  (void) ulCompanyId;
  (void) ulCompanyIdMask;
  (void) pxUuid;
  (void) pxUuidMask;
  (void) pxBdAddr;
  (void) cAddrType;
  (void) xDataLen;
  (void) pcData;
  (void) xMaskLen;
  (void) pcMask;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Clear all scan filter conditions for specific filter index.
 *
 * This function implements pxScanFilterClear function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvScanFilterClear( uint8_t ucAdapterIf,
                                      uint32_t ulFiltIndex )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) ulFiltIndex;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Enable / disable scan filter feature.
 *
 * This function implements pxScanFilterEnable function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvScanFilterEnable( uint8_t ucAdapterIf,
                                       bool bEnable )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) bEnable;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Determine the type of the remote device (LE, BR/EDR, Dual-mode).
 *
 * This function implements pxGetDeviceType function in @ref BTBleAdapter_t.
 */
static BTTransport_t prvGetDeviceType( const BTBdaddr_t * pxBdAddr )
{
  /* This function is not supported */
  (void) pxBdAddr;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return BTTransportLe;
}

/**
 * @brief Convert advertiser parameters to types used in SL BT API.
 *
 * @param[in] pxParams Advertising parameters received from use of BLE HAL
 * @param[out] pxSlBtAdvParams Filled with corresponding parameters for SL BT API
 *
 *
 */
static BTStatus_t prvConvertAdvParams( BTGattAdvertismentParams_t * pxParams,
                                       SlBtAdvParams_t * pxSlBtAdvParams )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "%s", "" );

  /* Log the input parameters */
  SILABS_BLE_LOG_PRINT_DEBUG(
    "  usMinAdvInterval=%"PRIu16", usMaxAdvInterval=%"PRIu16", usTimeout=%"PRIu16,
    pxParams->usMinAdvInterval, pxParams->usMaxAdvInterval, pxParams->usTimeout );

