espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  SILABS_BLE_LOG_PRINT_DEBUG(
    "  ucChannelMap=0x%x, ucPrimaryAdvertisingPhy=%u, ucSecondaryAdvertisingPhy=%u",
    ( unsigned ) pxParams->ucChannelMap,
    ( unsigned ) pxParams->ucPrimaryAdvertisingPhy,
    ( unsigned ) pxParams->ucSecondaryAdvertisingPhy );

  SILABS_BLE_LOG_PRINT_DEBUG("  ucTxPower=%u, xAddrType=%u",
                             ( unsigned ) pxParams->ucTxPower,
                             ( unsigned ) pxParams->xAddrType );

  /* Clear the output */
  memset(pxSlBtAdvParams, 0, sizeof(*pxSlBtAdvParams));

  /* Use stack-specific default intervals if the input params do not specify them */
  pxSlBtAdvParams->ulMinInterval = 100;
  pxSlBtAdvParams->ulMaxInterval = 200;
  if( pxParams->usMinAdvInterval > 0 )
  {
    pxSlBtAdvParams->ulMinInterval = pxParams->usMinAdvInterval;
  }
  if( pxParams->usMaxAdvInterval > 0 )
  {
    pxSlBtAdvParams->ulMaxInterval = pxParams->usMaxAdvInterval;
  }

  /* Both APIs specify timeout in units of 10 ms and use 0 for infinite */
  pxSlBtAdvParams->usTimeout = pxParams->usTimeout;

  /* Default to all channels if none are specified */
  pxSlBtAdvParams->ucChannelMap = 7;
  if( pxParams->ucChannelMap != 0 )
  {
    pxSlBtAdvParams->ucChannelMap = pxParams->ucChannelMap;
  }

  /* Convert the PHY selection */
  pxSlBtAdvParams->ucPrimaryPhy = prvBlePhyToSlGapPhyType(pxParams->ucPrimaryAdvertisingPhy);
  pxSlBtAdvParams->ucSecondaryPhy = prvBlePhyToSlGapPhyType(pxParams->ucSecondaryAdvertisingPhy);

  /* Convert the power level */
  BTStatus_t status = prvTxPowerIndexToSlBtPower( pxParams->ucTxPower,
                                                  &pxSlBtAdvParams->usRequestedPower );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "prvTxPowerIndexToSlBtPower(ucTxPower=%d) failed, status=%d",
                                    ( int ) pxParams->ucTxPower, status );
    return status;
  }

  /* Convert the address type */
  switch( pxParams->xAddrType )
  {
    case BTAddrTypePublic:
      pxSlBtAdvParams->ucAddressType = sl_bt_gap_public_address;
      break;

    case BTAddrTypeStaticRandom:
      pxSlBtAdvParams->ucAddressType = sl_bt_gap_static_address;
      break;

    case BTAddrTypeRandom:
      pxSlBtAdvParams->ucAddressType = sl_bt_gap_random_nonresolvable_address;
      break;

    case BTAddrTypeResolvable:
      pxSlBtAdvParams->ucAddressType = sl_bt_gap_random_resolvable_address;
      break;

    default:
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid address type %d", ( int ) pxParams->xAddrType );
      return eBTStatusParamInvalid;
  }

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", eBTStatusSuccess );
  return eBTStatusSuccess;
}

/*
 * Index and type bit mask for the most-significant byte of a Bluetooth address.
 * See Bluetooth Core Specification version 5.2, Volume 6, Part B, Section
 * 1.3.2.2 Private device address generation.
 */
#define BD_ADDR_TYPE_BYTE_INDEX             (5)
#define BD_ADDR_TYPE_MASK                   ((uint8_t) 0xC0)
#define BD_ADDR_TYPE_NON_RESOLVABLE_PRIVATE ((uint8_t) 0x00)
#define BD_ADDR_TYPE_STATIC_RANDOM          ((uint8_t) 0xC0)

/**
 * @brief Generate a random address of the specified type.
 *
 * @param[out] pxAddress Filled with the generated random address
 * @param[in] xAddressType The address type to generate
 *
 * @return SL_STATUS_OK if successful, otherwise an error code
 */
static sl_status_t prvGenerateRandomAddress(bd_addr * pxAddress,
                                            sl_bt_gap_address_type_t xAddressType)
{
  /* Get random bytes to construct a random address */
  size_t dataLen = 0;
  sl_status_t sl_status = sl_bt_system_get_random_data( sizeof(pxAddress->addr),
                                                        sizeof(pxAddress->addr),
                                                        &dataLen,
                                                        pxAddress->addr );

  /* Make sure we got all the bytes we requested */
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to get random data, sl_status=0x%x", sl_status );
    return sl_status;
  }
  if( dataLen < sizeof( pxAddress->addr ) )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to get enough random data, %u < %u",
                                    dataLen, sizeof( pxAddress->addr ) );
    return SL_STATUS_FAIL;
  }

  /* Set the type bits to indicate the correct type */
  pxAddress->addr[BD_ADDR_TYPE_BYTE_INDEX] &= ~BD_ADDR_TYPE_MASK;
  if( xAddressType == sl_bt_gap_static_address )
  {
    pxAddress->addr[BD_ADDR_TYPE_BYTE_INDEX] |= BD_ADDR_TYPE_STATIC_RANDOM;
  }
  else if( xAddressType == sl_bt_gap_random_nonresolvable_address )
  {
    pxAddress->addr[BD_ADDR_TYPE_BYTE_INDEX] |= BD_ADDR_TYPE_NON_RESOLVABLE_PRIVATE;
  }
  else
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid address type %d", ( int ) xAddressType );
    return SL_STATUS_INVALID_PARAMETER;
  }

  return SL_STATUS_OK;
}

/**
 * @brief Set advertiser parameters to SL BT API.
 *
 * @param[in] ucAdvSetHandle Advertisement set handle
 * @param[in] pxSlBtAdvParams Advertising parameters to set
 * @param[out] psSetTxPower Set TX power level, in the units used in the SL BT API
 *
 * @return SL_STATUS_OK if succesful, otherwise an error code
 */
static sl_status_t prvSlBtSetAdvParams( uint8_t ucAdvSetHandle,
                                        const SlBtAdvParams_t * pxSlBtAdvParams,
                                        int16_t * psSetTxPower )
{
  bd_addr address = { 0 };
  bd_addr addressOut = { 0 };
  sl_status_t sl_status = SL_STATUS_FAIL;

  /* Set the address type */
  if( pxSlBtAdvParams->ucAddressType == sl_bt_gap_public_address )
  {
    /* Clear the random address in order to use the default advertiser address
     * which is either the public device address programmed at production or the
     * address written into persistent storage using @ref
     * sl_bt_system_set_identity_address command. */
    SILABS_BLE_LOG_PRINT_DEBUG( "  clear random address%s", "" );
    sl_status = sl_bt_advertiser_clear_random_address( ucAdvSetHandle );
    if( sl_status != SL_STATUS_OK )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_advertiser_clear_random_address() failed, sl_status=0x%x",
                                      sl_status );
      return sl_status;
    }
  }
  else
  {
    /* The address is one of the random address types. See which one. */
    if( pxSlBtAdvParams->ucAddressType == sl_bt_gap_static_address )
    {
      /* Advertisers with static random address use the same shared address.
       * Generate it now if we don't have it already. */
      sl_status = SL_STATUS_OK;
      if( !bHaveAdvStaticRandomAddr )
      {
        sl_status = prvGenerateRandomAddress(&xAdvStaticRandomAddr, sl_bt_gap_static_address);
        if( sl_status != SL_STATUS_OK )
        {
          SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to generate static random address, sl_status=0x%x",
                                          sl_status );
          return sl_status;
        }
        bHaveAdvStaticRandomAddr = true;
      }

      /* Copy the shared address */
      memcpy( &address, &xAdvStaticRandomAddr, sizeof( address ) );
      SILABS_BLE_LOG_PRINT_DEBUG( "  use static random address "LOG_BDADDR_FORMAT,
                                  LOG_BDADDR_VALUE(&address) );
    }
    else if( pxSlBtAdvParams->ucAddressType == sl_bt_gap_random_nonresolvable_address )
    {
      /* Advertisers that use a random non-resolvable address get a fresh
       * random address */
      sl_status = prvGenerateRandomAddress(&address, sl_bt_gap_random_nonresolvable_address);
      if( sl_status != SL_STATUS_OK )
      {
        SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to generate non-resolvable random address, sl_status=0x%x",
                                        sl_status );
        return sl_status;
      }
      SILABS_BLE_LOG_PRINT_DEBUG( "  use random non-resolvable address "LOG_BDADDR_FORMAT,
                                  LOG_BDADDR_VALUE(&address) );
    }
    else
    {
      /* The type is a private resolvable random address. The Bluetooth stack
       * will generate the address internally and ignores the passed address. */
      sl_status = SL_STATUS_OK;
      SILABS_BLE_LOG_PRINT_DEBUG( "  let the stack generate private resolvable address%s", "" );
    }

    /* Set random address for this advertiser */
    sl_status = sl_bt_advertiser_set_random_address( ucAdvSetHandle,
                                                     pxSlBtAdvParams->ucAddressType,
                                                     address, &addressOut);
    if( sl_status != SL_STATUS_OK )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_advertiser_set_random_address() failed, sl_status=0x%x",
                                      sl_status );
      return sl_status;
    }

