espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
    SILABS_BLE_LOG_PRINT_INFO( "Current random address is xx:xx:xx:xx:%02x:%02x",
                               (unsigned)addressOut.addr[1], (unsigned)addressOut.addr[0]);
  }

  /* Set timing parameters */
  sl_status = sl_bt_advertiser_set_timing( ucAdvSetHandle,
                                           pxSlBtAdvParams->ulMinInterval,
                                           pxSlBtAdvParams->ulMaxInterval,
                                           pxSlBtAdvParams->usTimeout, 0 );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_advertiser_set_timing() failed, sl_status=0x%x",
                                    sl_status );
    return sl_status;
  }

  /* Set the advertising phy */
  sl_status = sl_bt_advertiser_set_phy( ucAdvSetHandle,
                                        pxSlBtAdvParams->ucPrimaryPhy,
                                        pxSlBtAdvParams->ucSecondaryPhy );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_advertiser_set_phy() failed, sl_status=0x%x",
                                    sl_status );
    return sl_status;
  }

  /* Set the channel map */
  sl_status = sl_bt_advertiser_set_channel_map( ucAdvSetHandle,
                                                pxSlBtAdvParams->ucChannelMap );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_advertiser_set_channel_map() failed, sl_status=0x%x",
                                    sl_status );
    return sl_status;
  }

  /* Set the power level */
  sl_status = sl_bt_advertiser_set_tx_power( ucAdvSetHandle,
                                             pxSlBtAdvParams->usRequestedPower,
                                             psSetTxPower );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_advertiser_set_tx_power() failed, sl_status=0x%x",
                                    sl_status );
    return sl_status;
  }

  return SL_STATUS_OK;
}

/* Advertisement data types specified at
 * https://www.bluetooth.com/specifications/assigned-numbers/generic-access-profile */
#define ADV_DATA_TYPE_FLAGS                      ((uint8_t) 0x01)
#define ADV_DATA_TYPE_INCOMPLETE_16BIT_UUIDS     ((uint8_t) 0x02)
#define ADV_DATA_TYPE_COMPLETE_16BIT_UUIDS       ((uint8_t) 0x03)
#define ADV_DATA_TYPE_INCOMPLETE_32BIT_UUIDS     ((uint8_t) 0x04)
#define ADV_DATA_TYPE_COMPLETE_32BIT_UUIDS       ((uint8_t) 0x05)
#define ADV_DATA_TYPE_INCOMPLETE_128BIT_UUIDS    ((uint8_t) 0x06)
#define ADV_DATA_TYPE_COMPLETE_128BIT_UUIDS      ((uint8_t) 0x07)
#define ADV_DATA_TYPE_SHORTENED_LOCAL_NAME       ((uint8_t) 0x08)
#define ADV_DATA_TYPE_COMPLETE_LOCAL_NAME        ((uint8_t) 0x09)
#define ADV_DATA_TYPE_TX_POWER_LEVEL             ((uint8_t) 0x0A)
#define ADV_DATA_TYPE_APPEARANCE                 ((uint8_t) 0x19)
#define ADV_DATA_TYPE_CONNECTION_INTERVAL_RANGE  ((uint8_t) 0x12)
#define ADV_DATA_TYPE_SERVICE_DATA_16BIT_UUID    ((uint8_t) 0x16)
#define ADV_DATA_TYPE_MANUFACTURER_DATA          ((uint8_t) 0xFF)

/*
 * Flag values from Bluetooth Core Specification Supplement, Part A, section 1.3.
 */
#define ADV_FLAG_GENERAL_DISCOVERABLE ((uint8_t) 0x02)
#define ADV_FLAG_BR_EDR_NOT_SUPPORTED ((uint8_t) 0x04)

/**
 * @brief Macro to set a uint16_t data item to advertisement data
 */
#define PRV_SET_ADV_DATA_UINT16(ptr, value) \
  do {                                      \
    uint16_t _value = (value);              \
    (ptr)[0] = (uint8_t) (_value & 0xFF);   \
    (ptr)[1] = (uint8_t) (_value >> 8);     \
  } while( 0 )

/* Packet type values for @ref sl_bt_advertiser_set_data() */
#define ADV_PACKET_TYPE_ADVERTISEMENT ((uint8_t) 0) /* Advertising packets */
#define ADV_PACKET_TYPE_SCAN_RESPONSE ((uint8_t) 1) /* Scan response packets */

/**
 * @brief Append advertisement data to a buffer
 *
 * @param[in,out] ppBufPos Position in the output buffer
 * @param[in,out] pSizeRemaining Number of bytes remaining in the output buffer
 * @param[in] ucDataType Type of the data, one of ADV_DATA_TYPE_* defines
 * @param[in] ucDataLen Length of the data
 * @param[in] pData Data bytes to append
 *
 * @return eBTStatusSuccess on success, otherwise an error code
 */
static BTStatus_t prvAppendAdvData( uint8_t ** ppBufPos,
                                    uint32_t * pSizeRemaining,
                                    uint8_t ucDataType,
                                    uint8_t ucDataLen,
                                    const void * pData )
{
  /* Make sure the data fits. We need one extra byte for type and another for length. */
  uint32_t entrySize = ucDataLen + 1 + 1;
  if( *pSizeRemaining < entrySize )
  {
    return eBTStatusParamInvalid;
  }

  /* Set the length, type, and data */
  uint8_t * pBufPos = *ppBufPos;
  pBufPos[0] = ucDataLen + 1; /* + 1 byte for the type */
  pBufPos[1] = ucDataType;
  if( ucDataLen > 0 )
  {
    memcpy(&pBufPos[2], pData, ucDataLen);
  }

  /* Update the outputs */
  (*ppBufPos) += entrySize;
  (*pSizeRemaining) -= entrySize;

  return eBTStatusSuccess;
}

/** @brief Structure to collect the properties of one type of service UUID */
typedef struct
{
  uint8_t ucDataTypeIncomplete; /**< Adv data type value to indicate an incomplete list */
  uint8_t ucDataTypeComplete;   /**< Adv data type value to indicate a complete list */
  uint8_t ucLength;             /**< Length of the UUID */
} SlBtServiceUuid_t;

/* Service UUID indexes */
#define SERVICE_UUID_16BIT_INDEX  0
#define SERVICE_UUID_32BIT_INDEX  1
#define SERVICE_UUID_128BIT_INDEX 2
#define NUM_SERVICE_UUID_TYPES    3

/** @brief Structure to collect the properties of one type of service UUID */
static const SlBtServiceUuid_t xServiceUuidProps[NUM_SERVICE_UUID_TYPES] =
{
  { ADV_DATA_TYPE_INCOMPLETE_16BIT_UUIDS,  ADV_DATA_TYPE_COMPLETE_16BIT_UUIDS,   2 },
  { ADV_DATA_TYPE_INCOMPLETE_32BIT_UUIDS,  ADV_DATA_TYPE_COMPLETE_32BIT_UUIDS,   4 },
  { ADV_DATA_TYPE_INCOMPLETE_128BIT_UUIDS, ADV_DATA_TYPE_COMPLETE_128BIT_UUIDS, 16 },
};

/**
 * @brief Generate advertisement data.
 *
 * See @ref pxSetAdvData function in @ref BTBleAdapter_t for description of the parameters.
 */
static BTStatus_t prvGenerateAdvertisementData( BTGattAdvertismentParams_t * pxParams,
                                                bool bIncludeAdvFlags,
                                                uint16_t usManufacturerLen,
                                                char * pcManufacturerData,
                                                uint16_t usServiceDataLen,
                                                char * pcServiceData,
                                                BTUuid_t * pxServiceUuid,
                                                size_t xNbServices,
                                                int16_t usSlBtSetPower,
                                                uint8_t * pucBuffer,
                                                size_t xBufferSize,
                                                size_t * pxAdvDataLen )
{
  uint8_t * pBufPos = pucBuffer;
  uint32_t sizeRemaining = xBufferSize;
  BTStatus_t status = eBTStatusSuccess;

