espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  /* Optionally append advertisement flags */
  if( bIncludeAdvFlags )
  {
    uint8_t flags = ADV_FLAG_GENERAL_DISCOVERABLE | ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    status = prvAppendAdvData( &pBufPos, &sizeRemaining, ADV_DATA_TYPE_FLAGS,
                               sizeof(flags), &flags );
    if( status != eBTStatusSuccess )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to add flags, status=%d", status );
      return status;
    }
  }

  /* Optionally append device name */
  if( pxParams->ucName.xType != BTGattAdvNameNone )
  {
    /* Get the complete name length */
    uint8_t nameType = ADV_DATA_TYPE_COMPLETE_LOCAL_NAME;
    uint8_t completeNameLen = (uint8_t) xSlBtHalManager.xDeviceNameLen;
    uint8_t usedNameLen = completeNameLen;

    /* Shorten the name if needed */
    if( pxParams->ucName.xType == BTGattAdvNameComplete )
    {
      /* Already OK */
    }
    else if( pxParams->ucName.xType == BTGattAdvNameShort )
    {
      if( pxParams->ucName.ucShortNameLen < completeNameLen )
      {
        usedNameLen = pxParams->ucName.ucShortNameLen;
        nameType = ADV_DATA_TYPE_SHORTENED_LOCAL_NAME;
      }
    }
    else
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid name type %d", ( int ) pxParams->ucName.xType );
      return eBTStatusParamInvalid;
    }

    /* Append the name */
    if( usedNameLen > 0 )
    {
      status = prvAppendAdvData( &pBufPos, &sizeRemaining, nameType,
                                 usedNameLen, xSlBtHalManager.pucDeviceName );
      if( status != eBTStatusSuccess )
      {
        SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to add name, status=%d", status );
        return status;
      }
    }
  }

  /* Optionally append appearance */
  if( pxParams->ulAppearance != 0 )
  {
    /* Verify validity */
    if( pxParams->ulAppearance > UINT16_MAX )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid appearance value %"PRIu32, pxParams->ulAppearance );
      return eBTStatusParamInvalid;
    }

    /* Appearance item is two octets long */
    uint8_t appearanceBuf[2];
    PRV_SET_ADV_DATA_UINT16( appearanceBuf, (uint16_t) pxParams->ulAppearance );

    status = prvAppendAdvData( &pBufPos, &sizeRemaining, ADV_DATA_TYPE_APPEARANCE,
                               sizeof(appearanceBuf), appearanceBuf );
    if( status != eBTStatusSuccess )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to add appearance, status=%d", status );
      return status;
    }
  }

  /* Optionally append TX power level */
  if( pxParams->bIncludeTxPower )
  {
    /* SL BT API defines power levels in units of 0.1 dBm. If we have a value in the valid range,
     * append the power level data item. */
    if( (usSlBtSetPower >= -1270) &&
        (usSlBtSetPower <= 1270) )
    {
      int8_t txPowerLevel = usSlBtSetPower / 10;
      status = prvAppendAdvData( &pBufPos, &sizeRemaining, ADV_DATA_TYPE_TX_POWER_LEVEL,
                                 sizeof(txPowerLevel), &txPowerLevel );
      if( status != eBTStatusSuccess )
      {
        SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to add TX power level, status=%d", status );
        return status;
      }
    }
  }

  /* Optionally append connection interval range */
  if( (pxParams->ulMinInterval != 0) && (pxParams->ulMaxInterval != 0) )
  {
    /* Verify validity */
    if( (pxParams->ulMinInterval > UINT16_MAX) || (pxParams->ulMaxInterval > UINT16_MAX) )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid ulMinInterval=%"PRIu32" or ulMaxInterval=%"PRIu32,
                                      pxParams->ulMinInterval, pxParams->ulMaxInterval );
      return eBTStatusParamInvalid;
    }

    /* The interval range data is 4 octets long (Bluetooth Core Specification Supplement, Part A,
     * section 1.9). */
    uint8_t intervalRangeBuf[4];
    PRV_SET_ADV_DATA_UINT16( &intervalRangeBuf[0], (uint16_t) pxParams->ulMinInterval );
    PRV_SET_ADV_DATA_UINT16( &intervalRangeBuf[2], (uint16_t) pxParams->ulMaxInterval );

    status = prvAppendAdvData( &pBufPos, &sizeRemaining, ADV_DATA_TYPE_CONNECTION_INTERVAL_RANGE,
                               sizeof(intervalRangeBuf), intervalRangeBuf );
    if( status != eBTStatusSuccess )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to add connection interval range, status=%d", status );
      return status;
    }
  }

  /* Optionally append service UUIDs */
  if( ( xNbServices > 0 ) && ( pxServiceUuid != NULL ) )
  {
    /* Get the number of UUIDs per type and the UUID to include in the advertisement */
    uint8_t numUuids[NUM_SERVICE_UUID_TYPES] = { 0 };
    const void * uuidToInclude[NUM_SERVICE_UUID_TYPES] = { NULL };

    for( uint32_t i = 0; i < xNbServices; i++ )
    {
      /* Map the type to an index */
      uint32_t typeIndex = 0;
      switch( pxServiceUuid[i].ucType )
      {
        case eBTuuidType16:  typeIndex = SERVICE_UUID_16BIT_INDEX;  break;
        case eBTuuidType32:  typeIndex = SERVICE_UUID_32BIT_INDEX;  break;
        case eBTuuidType128: typeIndex = SERVICE_UUID_128BIT_INDEX; break;
        default:
          SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid UUID type %d", ( int ) pxServiceUuid[i].ucType );
          return eBTStatusParamInvalid;
      }

      /* Remember the pointer to the first UUID of this type */
      if( numUuids[typeIndex] == 0 )
      {
        uuidToInclude[typeIndex] = &pxServiceUuid[i].uu;
      }
      numUuids[typeIndex]++;
    }

    /* Append the data for each type */
    for( uint32_t i = 0; i < NUM_SERVICE_UUID_TYPES; i++ )
    {
      if( numUuids[i] > 0 )
      {
        uint8_t ucDataType = numUuids[i] > 1 ?
          xServiceUuidProps[i].ucDataTypeIncomplete : xServiceUuidProps[i].ucDataTypeComplete;
        status = prvAppendAdvData( &pBufPos, &sizeRemaining, ucDataType,
                                   xServiceUuidProps[i].ucLength, uuidToInclude[i] );
        if( status != eBTStatusSuccess )
        {
          SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to add service UUIDs, status=%d", status );
          return status;
        }
      }
    }
  }

  /* Optionally append service data */
  if( ( usServiceDataLen > 0 ) && ( pcServiceData != NULL ) )
  {
    status = prvAppendAdvData( &pBufPos, &sizeRemaining, ADV_DATA_TYPE_SERVICE_DATA_16BIT_UUID,
                               usServiceDataLen, pcServiceData );
    if( status != eBTStatusSuccess )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to add service data, status=%d", status );
      return status;
    }
  }

  /* Optionally append manufacturer data */
  if( ( usManufacturerLen > 0 ) && ( pcManufacturerData != NULL ) )
  {
    status = prvAppendAdvData( &pBufPos, &sizeRemaining, ADV_DATA_TYPE_MANUFACTURER_DATA,
                               usManufacturerLen, pcManufacturerData );
    if( status != eBTStatusSuccess )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to add manufacturer data, status=%d", status );
      return status;
    }
  }

  /* Set the final size */
  *pxAdvDataLen = xBufferSize - sizeRemaining;

