espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  return eBTStatusSuccess;
}

/**
 * @brief Configure the advertiser in the given adapter context.
 *
 * @param[in] pxAdapterIf The adapter context to configure
 * @param[in] pxParams Advertising parameters to use
 *
 * @return eBTStatusSuccess on success, otherwise an error code
 */
static BTStatus_t prvConfigureAdapterAdvertiser( SlBtAdapterIf_t * pxAdapterIf,
                                                 BTGattAdvertismentParams_t * pxParams )
{
  /* Remember the advertising connectable mode */
  BTStatus_t status = prvAdvEventPropsToSlAdvConnectableMode( pxParams->usAdvertisingEventProperties,
                                                              &pxAdapterIf->ucAdvConnectableMode );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to convert connectable mode %d, status=%d",
                                    ( int ) pxParams->usAdvertisingEventProperties, status );
    return status;
  }

  /* Convert the advertising parameters */
  SlBtAdvParams_t xSlBtAdvParams;
  status = prvConvertAdvParams( pxParams, &xSlBtAdvParams );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to convert advertisement params, status=%d", status );
    return status;
  }

  /* Set the advertising parameters */
  pxAdapterIf->sSetAdvPower = 0;
  sl_status_t sl_status = prvSlBtSetAdvParams( pxAdapterIf->ucAdvSetHandle,
                                               &xSlBtAdvParams,
                                               &pxAdapterIf->sSetAdvPower );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to set advertisement params, sl_status=0x%x", sl_status );
    return prvSlStatusToBTStatus( sl_status );
  }

  return eBTStatusSuccess;
}

/**
 * @brief Set the advertisement data to SL BT stack.
 *
 * See @ref pxSetAdvData function in @ref BTBleAdapter_t for description of the parameters.
 */
static BTStatus_t prvSetAdvertisementData( uint8_t ucAdvSetHandle,
                                           BTGattAdvertismentParams_t * pxParams,
                                           uint16_t usManufacturerLen,
                                           char * pcManufacturerData,
                                           uint16_t usServiceDataLen,
                                           char * pcServiceData,
                                           BTUuid_t * pxServiceUuid,
                                           size_t xNbServices,
                                           int16_t usSlBtSetPower )
{
  /* Generate the advertisement data */
  uint8_t advBuf[MAX_LEGACY_ADV_DATA_LEN];
  size_t advDataLen = 0;
  bool bIncludeAdvFlags = !pxParams->bSetScanRsp;
  BTStatus_t status = prvGenerateAdvertisementData( pxParams, bIncludeAdvFlags,
                                                    usManufacturerLen, pcManufacturerData,
                                                    usServiceDataLen, pcServiceData,
                                                    pxServiceUuid, xNbServices, usSlBtSetPower,
                                                    advBuf, sizeof(advBuf),
                                                    &advDataLen );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to generate advertisement data, status=%d", status );
    return status;
  }

  /* Set the user data to the Bluetooth stack */
  uint8_t ucPacketType = pxParams->bSetScanRsp ?
    ADV_PACKET_TYPE_SCAN_RESPONSE : ADV_PACKET_TYPE_ADVERTISEMENT;
  sl_status_t sl_status = sl_bt_advertiser_set_data( ucAdvSetHandle, ucPacketType, advDataLen, advBuf );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_advertiser_set_data() failed, sl_status=0x%x", sl_status );
    return prvSlStatusToBTStatus( sl_status );
  }

  return eBTStatusSuccess;
}

/**
 * @brief Set the advertising data or scan response data.
 *
 * This function implements pxSetAdvData function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvSetAdvData( uint8_t ucAdapterIf,
                                 BTGattAdvertismentParams_t * pxParams,
                                 uint16_t usManufacturerLen,
                                 char * pcManufacturerData,
                                 uint16_t usServiceDataLen,
                                 char * pcServiceData,
                                 BTUuid_t * pxServiceUuid,
                                 size_t xNbServices )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "ucAdapterIf=%d", (int) ucAdapterIf );

  /* Get the adapterIf context and create its advertiser set if necessary */
  SlBtAdapterIf_t * pxAdapterIf = NULL;
  BTStatus_t status = prvGetAdapterIfWithAdvSet( ucAdapterIf, SlBtHalAdvApiBasic, &pxAdapterIf );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to get adapter with advertiser, status=%d", status );
    return status;
  }

  /* Check parameters */
  if( pxParams == NULL )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "NULL params, status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Configure the advertiser in this adapter context */
  status = prvConfigureAdapterAdvertiser( pxAdapterIf, pxParams );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to configure, status=%d", status );
    return status;
  }

  /* Set the advertisement data */
  status = prvSetAdvertisementData( pxAdapterIf->ucAdvSetHandle,
                                    pxParams, usManufacturerLen, pcManufacturerData,
                                    usServiceDataLen, pcServiceData,
                                    pxServiceUuid, xNbServices,
                                    pxAdapterIf->sSetAdvPower );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to set data, status=%d", status );
    return status;
  }

  /* Give the callback to the application */
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxSetAdvDataCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxSetAdvDataCb", "status=%d", eBTStatusSuccess );
    pxBleAdapterCallbacks->pxSetAdvDataCb( eBTStatusSuccess );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxSetAdvDataCb" );
  }

