espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", eBTStatusSuccess );
  return eBTStatusSuccess;
}

/**
 * @brief Set the advertising data of complete 31 bytes or scan response data.
 *
 * This function implements pxSetAdvRawData function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvSetAdvRawData( uint8_t ucAdapterIf,
                                    uint8_t * pucData,
                                    uint8_t ucLen )
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "ucAdapterIf=%d", (int) ucAdapterIf );

  /* Get the adapterIf context and create its advertiser set if necessary */
  SlBtAdapterIf_t * pxAdapterIf = NULL;
  BTStatus_t status = prvGetAdapterIfWithAdvSet( ucAdapterIf, SlBtHalAdvApiBasic, &pxAdapterIf );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to get adapter with advertiser, status=%d", status );
    return status;
  }

  /* This function is not supported */
  (void) pucData;
  (void) ucLen;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Request a connection parameter update.
 *
 * This function implements pxConnParameterUpdateRequest function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvConnParameterUpdateRequest( const BTBdaddr_t * pxBdAddr,
                                                 uint32_t ulMinInterval,
                                                 uint32_t ulMaxInterval,
                                                 uint32_t ulLatency,
                                                 uint32_t ulTimeout )
{
  /* Verify the address pointer first to avoid trying to log with NULL pointer */
  if( pxBdAddr == NULL )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "NULL pxBdAddr, status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "pxBdAddr="LOG_BDADDR_FORMAT", "
                                  "ulMinInterval=%"PRIu32", ulMaxInterval=%"PRIu32", "
                                  "ulLatency=%"PRIu32", ulTimeout=%"PRIu32,
                                  LOG_BTBDADDR_T_VALUE( pxBdAddr ),
                                  ulMinInterval, ulMaxInterval, ulLatency, ulTimeout );

  /* Find the connection */
  SlBtConnections_t * pxConnection = prvGetConnectionByAddress( pxBdAddr );
  if ( pxConnection == NULL )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to find connection, status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Verify that the values are in valid range */
  if( ( ulMinInterval < MIN_CONNECTION_INTERVAL ) || ( ulMinInterval > MAX_CONNECTION_INTERVAL ) ||
      ( ulMaxInterval < MIN_CONNECTION_INTERVAL ) || ( ulMaxInterval > MAX_CONNECTION_INTERVAL ) ||
      ( ulLatency > MAX_SLAVE_LATENCY ) ||
      ( ulTimeout < MIN_CONNECTION_TIMEOUT ) || ( ulTimeout > MAX_CONNECTION_TIMEOUT ) )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid parameter, status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Remember the parameters requested for this connection */
  pxConnection->usMinInterval = (uint16_t) ulMinInterval;
  pxConnection->usMaxInterval = (uint16_t) ulMaxInterval;

  /* Set connection parameters with no limits on CE length */
  uint16_t usMinCeLength = 0;
  uint16_t usMaxCeLength = 0xFFFF;
  sl_status_t sl_status = sl_bt_connection_set_parameters(pxConnection->ucConnectionHandle,
                                                          (uint16_t) ulMinInterval,
                                                          (uint16_t) ulMaxInterval,
                                                          (uint16_t) ulLatency,
                                                          (uint16_t) ulTimeout,
                                                          usMinCeLength,
                                                          usMaxCeLength );
  if( sl_status != SL_STATUS_OK )
  {
    /* When failed, no local request for these parameters is pending. Clear the values. */
    pxConnection->usMinInterval = 0;
    pxConnection->usMaxInterval = 0;

    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "sl_bt_connection_set_parameters() failed, sl_status=0x%x",
                                    sl_status);
    return prvSlStatusToBTStatus( sl_status );
  }

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", eBTStatusSuccess);
  return eBTStatusSuccess;
}

/**
 * @brief Sets the LE scan interval and window in units of N*0.625 msec.
 *
 * This function implements pxSetScanParameters function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvSetScanParameters( uint8_t ucAdapterIf,
                                        uint32_t ulScanInterval,
                                        uint32_t ulScanWindow )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG(
    "ucAdapterIf=%d, ulScanInterval=%"PRIu32", ulScanWindow=%"PRIu32,
    (int) ucAdapterIf, ulScanInterval, ulScanWindow );

  /* Get the adapter context just to verify it */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIf( ucAdapterIf );
  if( !pxAdapterIf )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to get adapter, status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Verify that the values fit to the stack's 16-bit parameters */
  if( ( ulScanInterval > UINT16_MAX ) || ( ulScanWindow > UINT16_MAX ) )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid parameters, status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* The stack function uses the same units and has the same behaviour as
   * expected of the BLE HAL, i.e. the parameter change takes effect the next
   * time scanning is started. */
  sl_status_t sl_status = sl_bt_scanner_set_timing( SCANNER_PHYS_1M,
                                                    (uint16_t) ulScanInterval,
                                                    (uint16_t) ulScanWindow );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to set timing, sl_status=0x%x", sl_status);
    return prvSlStatusToBTStatus( sl_status );
  }

  /* Give the callback to the application */
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxScanParameterSetupCompletedCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxScanParameterSetupCompletedCb", "ucAdapterIf=%d, status=%d",
                                  ucAdapterIf, eBTStatusSuccess );
    pxBleAdapterCallbacks->pxScanParameterSetupCompletedCb( ucAdapterIf,
                                                            eBTStatusSuccess );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxScanParameterSetupCompletedCb" );
  }

