espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", eBTStatusSuccess);
  return eBTStatusSuccess;
}

/**
 * @brief Setup the parameters as per spec, user manual specified values and enable multi ADV.
 *
 * This function implements pxMultiAdvEnable function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvMultiAdvEnable( uint8_t ucAdapterIf,
                                     BTGattAdvertismentParams_t * xAdvParams )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "ucAdapterIf=%d", (int) ucAdapterIf );

  /* Check parameters */
  if( xAdvParams == NULL )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "NULL xAdvParams, status=%d",
                              eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Get the adapterIf context and create its advertiser set if necessary */
  SlBtAdapterIf_t * pxAdapterIf = NULL;
  BTStatus_t status = prvGetAdapterIfWithAdvSet( ucAdapterIf, SlBtHalAdvApiMultiAdv, &pxAdapterIf );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to get adapter with advertiser, status=%d", status );
    return status;
  }

  /* If advertisement is already active, return an error */
  if( pxAdapterIf->bAdvActive )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "already active, status=%d", eBTStatusBusy );
    return eBTStatusBusy;
  }

  /* Configure the advertiser in this adapter context */
  status = prvConfigureAdapterAdvertiser( pxAdapterIf, xAdvParams );
  if( status != eBTStatusSuccess )
  {
    /* Delete the advertiser set that we failed to configure */
    sl_bt_advertiser_delete_set( pxAdapterIf->ucAdvSetHandle );
    pxAdapterIf->ucAdvSetHandle = SL_BT_INVALID_ADVERTISING_SET_HANDLE;
    pxAdapterIf->xAdvApiType = SlBtHalAdvApiNone;
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to configure, status=%d", status );
    return status;
  }

  /* Call the application */
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxMultiAdvEnableCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxMultiAdvEnableCb", "ucAdapterIf=%d, status=%d",
                                  ucAdapterIf, eBTStatusSuccess );
    pxBleAdapterCallbacks->pxMultiAdvEnableCb( ucAdapterIf, eBTStatusSuccess );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxMultiAdvEnableCb" );
  }

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", eBTStatusSuccess );
  return eBTStatusSuccess;
}

/**
 * @brief Update the parameters as per spec, user manual specified values and restart multi ADV.
 *
 * This function implements pxMultiAdvUpdate function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvMultiAdvUpdate( uint8_t ucAdapterIf,
                                     BTGattAdvertismentParams_t * advParams )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) advParams;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Setup the raw data for the specified instance.
 *
 * This function implements pxMultiAdvSetInstRawData function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvMultiAdvSetInstRawData( uint8_t ucAdapterIf,
                                             bool bSetScanRsp,
                                             uint8_t * pucData,
                                             size_t xDataLen )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "ucAdapterIf=%d, bSetScanRsp=%d, xDataLen=%u",
                                  ( int ) ucAdapterIf, ( int ) bSetScanRsp, xDataLen );

  /* We must have an adapter and it must already have an advertiser set for a
   * multi-advertiser */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIf( ucAdapterIf );
  if( ( pxAdapterIf == NULL ) ||
      ( pxAdapterIf->ucAdvSetHandle == SL_BT_INVALID_ADVERTISING_SET_HANDLE ) ||
      ( pxAdapterIf->xAdvApiType != SlBtHalAdvApiMultiAdv ) )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid ucAdapterIf, status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* If advertisement is already active, return an error */
  if( pxAdapterIf->bAdvActive )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "already active, status=%d", eBTStatusBusy );
    return eBTStatusBusy;
  }

  /* If we're not setting a scan response, prepend advertisement flags */
  uint8_t ucAdvBuf[MAX_LEGACY_ADV_DATA_LEN];
  if( !bSetScanRsp )
  {
    /* Include the flags */
    size_t xAdvDataLen = 0;
    ucAdvBuf[xAdvDataLen++] = 2; /* Length */
    ucAdvBuf[xAdvDataLen++] = ADV_DATA_TYPE_FLAGS; /* Type */
    ucAdvBuf[xAdvDataLen++] = ADV_FLAG_GENERAL_DISCOVERABLE | ADV_FLAG_BR_EDR_NOT_SUPPORTED; /* Value */

    /* Include the user data */
    if( xDataLen > sizeof( ucAdvBuf ) - xAdvDataLen )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "could not fit user data, xDataLen=%d, status=%d",
                                (int) xDataLen, eBTStatusParamInvalid );
      return eBTStatusParamInvalid;
    }
    memcpy( &ucAdvBuf[xAdvDataLen], pucData, xDataLen );
    xDataLen += xAdvDataLen;
    pucData = ucAdvBuf;
  }

  /* Set the user data to the Bluetooth stack */
  uint8_t ucPacketType = bSetScanRsp ?
    ADV_PACKET_TYPE_SCAN_RESPONSE : ADV_PACKET_TYPE_ADVERTISEMENT;
  sl_status_t sl_status = sl_bt_advertiser_set_data( pxAdapterIf->ucAdvSetHandle,
                                                     ucPacketType, xDataLen, pucData );
  if( sl_status != SL_STATUS_OK )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to set data, sl_status=0x%x", sl_status );
    return prvSlStatusToBTStatus( sl_status );
  }

  /* Advertisement is started when the scan response is set, or immediately when
  the advertiser is not scannable */
  bool bIsScannable =
    ( pxAdapterIf->ucAdvConnectableMode == sl_bt_advertiser_connectable_scannable ) ||
    ( pxAdapterIf->ucAdvConnectableMode == sl_bt_advertiser_scannable_non_connectable );
  if( bSetScanRsp || ( !bIsScannable ) )
  {
    /* Start advertising with user-defined data */
    sl_status = sl_bt_advertiser_start( pxAdapterIf->ucAdvSetHandle,
                                        sl_bt_advertiser_user_data,
                                        pxAdapterIf->ucAdvConnectableMode );
    if( sl_status != SL_STATUS_OK )
    {
      SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to start advertising, sl_status=0x%x",
                                sl_status );
      return prvSlStatusToBTStatus( sl_status );
    }
    pxAdapterIf->bAdvActive = true;
  }

  /* Call the application */
  if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxMultiAdvDataCb )
  {
    SILABS_BLE_LOG_CB_CALL_DEBUG( "pxMultiAdvDataCb", "ucAdapterIf=%d, status=%d",
                                  ucAdapterIf, eBTStatusSuccess );
    pxBleAdapterCallbacks->pxMultiAdvDataCb( ucAdapterIf, eBTStatusSuccess );
    SILABS_BLE_LOG_CB_RETURN_DEBUG( "pxMultiAdvDataCb" );
  }

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", eBTStatusSuccess );
  return eBTStatusSuccess;
}

/**
 * @brief Setup the data for the specified instance.
 *
 * This function implements pxMultiAdvSetInstData function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvMultiAdvSetInstData( uint8_t ucAdapterIf,
                                          bool bSetScanRsp,
                                          bool bIncludeName,
                                          bool bInclTxpower,
                                          uint32_t ulAppearance,
                                          size_t xManufacturerLen,
                                          char * pcManufacturerData,
                                          size_t xServiceDataLen,
                                          char * pcServiceData,
                                          BTUuid_t * pxServiceUuid,
                                          size_t xNbServices )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "ucAdapterIf=%d, bSetScanRsp=%d",
                             (int) ucAdapterIf, (int) bSetScanRsp );

  /* We must have an adapter and it must already have an advertiser set for a
   * multi-advertiser */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIf( ucAdapterIf );
  if( ( pxAdapterIf == NULL ) ||
      ( pxAdapterIf->ucAdvSetHandle == SL_BT_INVALID_ADVERTISING_SET_HANDLE ) ||
      ( pxAdapterIf->xAdvApiType != SlBtHalAdvApiMultiAdv ) )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid ucAdapterIf, status=%d",
                              eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Initialize the advertisement parameters needed by prvGenerateAdvertisementData */
  BTGattAdvertismentParams_t xParams;
  memset( &xParams, 0, sizeof(xParams) );
  xParams.bSetScanRsp = bSetScanRsp;
  if( bIncludeName )
  {
    xParams.ucName.xType = BTGattAdvNameComplete;
  }
  else
  {
    xParams.ucName.xType = BTGattAdvNameNone;
  }
  xParams.bIncludeTxPower = bInclTxpower;
  xParams.ulAppearance = ulAppearance;

  /* Generate the advertisement data. We never include advertisement flags, as
  prvMultiAdvSetInstRawData() will include them automatically when relevant. */
  uint8_t advBuf[MAX_LEGACY_ADV_DATA_LEN];
  size_t advDataLen = 0;
  bool bIncludeAdvFlags = false;
  BTStatus_t status = prvGenerateAdvertisementData( &xParams, bIncludeAdvFlags,
                                                    xManufacturerLen, pcManufacturerData,
                                                    xServiceDataLen, pcServiceData,
                                                    pxServiceUuid, xNbServices,
                                                    pxAdapterIf->sSetAdvPower,
                                                    advBuf, sizeof(advBuf),
                                                    &advDataLen );
  if( status != eBTStatusSuccess )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "failed to generate data, status=%d", status );
    return status;
  }

  /* Set as raw data */
  status = prvMultiAdvSetInstRawData( ucAdapterIf, bSetScanRsp, advBuf, advDataLen );

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", status );
  return status;
}

/**
 * @brief Disable the multi adv instance.
 *
 * This function implements pxMultiAdvDisable function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvMultiAdvDisable( uint8_t ucAdapterIf )
{
  SILABS_BLE_LOG_FUNC_ENTRY_DEBUG( "ucAdapterIf=%d", (int) ucAdapterIf );

  /* We must have a multi-advertiser adapter */
  SlBtAdapterIf_t * pxAdapterIf = prvGetAdapterIf( ucAdapterIf );
  if( ( pxAdapterIf == NULL ) ||
      ( pxAdapterIf->xAdvApiType != SlBtHalAdvApiMultiAdv ) )
  {
    SILABS_BLE_LOG_FUNC_EXIT_ERROR( "invalid ucAdapterIf, status=%d", eBTStatusParamInvalid );
    return eBTStatusParamInvalid;
  }

  /* Delete the set. This will also make the callback to the app. */
  prvDeleteMultiAdvertiserAdvSet( pxAdapterIf );

  SILABS_BLE_LOG_FUNC_EXIT_DEBUG( "status=%d", eBTStatusSuccess );
  return eBTStatusSuccess;
}

/**
 * @brief Configure the batchscan storage.
 *
 * This function implements pxBatchscanCfgStorage function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvBatchscanCfgStorage( uint8_t ucAdapterIf,
                                          uint32_t ulBatchScanFullMax,
                                          uint32_t ulBatchScanTruncMax,
                                          uint32_t ulBatchScanNotifyThreshold )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) ulBatchScanFullMax;
  (void) ulBatchScanTruncMax;
  (void) ulBatchScanNotifyThreshold;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Enable batchscan.
 *
 * This function implements pxBatchscanEndBatchScan function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvBatchscanEndBatchScan( uint8_t ucAdapterIf,
                                            uint32_t ulScanMode,
                                            uint32_t ulScanInterval,
                                            uint32_t ulScanWindow,
                                            uint32_t ulAddrType,
                                            uint32_t ulDiscardRule )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) ulScanMode;
  (void) ulScanInterval;
  (void) ulScanWindow;
  (void) ulAddrType;
  (void) ulDiscardRule;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Disable batchscan.
 *
 * This function implements pxBatchscanDisBatchScan function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvBatchscanDisBatchScan( uint8_t ucAdapterIf )
{
  /* This function is not supported */
  (void) ucAdapterIf;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief  Read out batchscan reports.
 *
 * This function implements pxBatchscanReadReports function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvBatchscanReadReports( uint8_t ucAdapterIf,
                                           uint32_t ulScanMode )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) ulScanMode;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Set preferred PHY for a connection.
 *
 * This function implements pxSetPreferredPhy function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvSetPreferredPhy( uint16_t usConnId,
                                      uint8_t ucTxPhy,
                                      uint8_t ucRxPhy,
                                      uint16_t usPhyOptions )
{
  /* This function is not supported */
  (void) usConnId;
  (void) ucTxPhy;
  (void) ucRxPhy;
  (void) usPhyOptions;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Read the PHY used for a connection.
 *
 * This function implements pxReadPhy function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvReadPhy( uint16_t usConnId,
                              BTReadClientPhyCallback_t xCb )
{
  /* This function is not supported */
  (void) usConnId;
  (void) xCb;
  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Sets the LE background scan interval and window in units of N*0.625 msec.
 *
 * This function implements pxSetBgScanParameters function in @ref BTBleAdapter_t.
 */
static BTStatus_t prvSetBgScanParameters( uint8_t ucAdapterIf,
                                          uint32_t ulScanIntervalTime,
                                          uint32_t ulScanWindowTime )
{
  /* This function is not supported */
  (void) ucAdapterIf;
  (void) ulScanIntervalTime;
  (void) ulScanWindowTime;

  SILABS_BLE_LOG_FUNC_UNSUPPORTED( SILABS_BLE_LOG_WARN );
  return eBTStatusUnsupported;
}

/**
 * @brief Silicon Labs BLE adapter interface functions.
 */
static const BTBleAdapter_t xSilabsBTBleAdapter =
{
  .pxRegisterBleApp = prvRegisterBleApp,
  .pxUnregisterBleApp = prvUnregisterBleApp,
  .pxBleAdapterInit = prvBleAdapterInit,
  .pxGetBleAdapterProperty = prvGetBleAdapterProperty,
  .pxSetBleAdapterProperty = prvSetBleAdapterProperty,
  .pxGetallBleRemoteDeviceProperties = prvGetallBleRemoteDeviceProperties,
  .pxGetBleRemoteDeviceProperty = prvGetBleRemoteDeviceProperty,
  .pxSetBleRemoteDeviceProperty = prvSetBleRemoteDeviceProperty,
  .pxScan = prvScan,
  .pxConnect = prvConnect,
  .pxDisconnect = prvDisconnect,
  .pxStartAdv = prvStartAdv,
  .pxStopAdv = prvStopAdv,
  .pxReadRemoteRssi = prvReadRemoteRssi,
  .pxScanFilterParamSetup = prvScanFilterParamSetup,
  .pxScanFilterAddRemove = prvScanFilterAddRemove,
  .pxScanFilterClear = prvScanFilterClear,
  .pxScanFilterEnable = prvScanFilterEnable,
  .pxGetDeviceType = prvGetDeviceType,
  .pxSetAdvData = prvSetAdvData,
  .pxSetAdvRawData = prvSetAdvRawData,
  .pxConnParameterUpdateRequest = prvConnParameterUpdateRequest,
  .pxSetScanParameters = prvSetScanParameters,
  .pxMultiAdvEnable = prvMultiAdvEnable,
  .pxMultiAdvUpdate = prvMultiAdvUpdate,
  .pxMultiAdvSetInstData = prvMultiAdvSetInstData,
  .pxMultiAdvDisable = prvMultiAdvDisable,
  .pxBatchscanCfgStorage = prvBatchscanCfgStorage,
  .pxBatchscanEndBatchScan = prvBatchscanEndBatchScan,
  .pxBatchscanDisBatchScan = prvBatchscanDisBatchScan,
  .pxBatchscanReadReports = prvBatchscanReadReports,
  .pxSetPreferredPhy = prvSetPreferredPhy,
  .pxReadPhy = prvReadPhy,
  .ppvGetGattClientInterface = prvGetGattClientInterface,
  .ppvGetGattServerInterface = prvGetGattServerInterface,
  .pxMultiAdvSetInstRawData = prvMultiAdvSetInstRawData,
  .pxSetBgScanParameters = prvSetBgScanParameters,
};

/* Retrieves the HAL LE interface. */
const void * prvGetLeAdapter( )
{
  return &xSilabsBTBleAdapter;
}

