espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/aws_iot_libs/vendors/siliconlabs/boards/all/ports/ble/source/sl_bt_hal_manager_adapter_ble.c
/* Invoked on BTInterface_t's pxDisable() to cleanup adapter state */
void prvBleAdapterOnPxDisable()
{
  SILABS_BLE_LOG_FUNC_ENTRY_INFO( "%s", "" );

  /* Stop and cleanup advertiser sets */
  SlBtAdapterIf_t * pxAdapterIf = pxAdapterIfs;
  while( pxAdapterIf != NULL )
  {
    if( ( pxAdapterIf->xClient.ucHandle != SL_BT_INVALID_IF_HANDLE ) )
    {
      /* If we have an advertiser set, clean that up */
      if( pxAdapterIf->ucAdvSetHandle != SL_BT_INVALID_ADVERTISING_SET_HANDLE )
      {
        /* Handle the implicit stop of the advertiser */
        prvStopAdvertiserImplicitly( pxAdapterIf );

        /* If we still have a set (wasn't deleted already for a
         * multi-advertiser), delete it now */
        if( pxAdapterIf->ucAdvSetHandle != SL_BT_INVALID_ADVERTISING_SET_HANDLE )
        {
          sl_bt_advertiser_delete_set( pxAdapterIf->ucAdvSetHandle );
          pxAdapterIf->ucAdvSetHandle = SL_BT_INVALID_ADVERTISING_SET_HANDLE;
        }

        pxAdapterIf->xAdvApiType = SlBtHalAdvApiNone;
      }
    }

    pxAdapterIf = ( SlBtAdapterIf_t * ) pxAdapterIf->xClient.pxNext;
  }

  /* Close all connections */
  for( uint8_t i = 0; i < SL_BT_CONFIG_MAX_CONNECTIONS; i ++ )
  {
    SlBtConnections_t * pxConnection = &xBtConnections[i];
    if( pxConnection->ucAdapterIf != SL_BT_INVALID_IF_HANDLE )
    {
      /* Close the connection and ignore the status, as there's nothing we could do to recover here */
      sl_status_t sl_status = sl_bt_connection_close( pxConnection->ucConnectionHandle );
      (void) sl_status;

      /* Simulate an immediate disconnection by giving the callback already here */
      if( pxBleAdapterCallbacks && pxBleAdapterCallbacks->pxCloseCb )
      {
        SILABS_BLE_LOG_CB_CALL_INFO( "pxCloseCb", "connection=%d, reason=%d, ucHandle=0x%x",
                                     ( int ) pxConnection->ucConnectionHandle,
                                     ( int ) eBTGattStatusLocalHostTerminatedConnection,
                                     ( int ) pxConnection->ucAdapterIf );
        pxBleAdapterCallbacks->pxCloseCb( pxConnection->ucConnectionHandle,
                                          eBTGattStatusLocalHostTerminatedConnection,
                                          pxConnection->ucAdapterIf,
                                          &pxConnection->xRemoteAddress );
        SILABS_BLE_LOG_CB_RETURN_INFO( "pxCloseCb" );
      }

      /* Delete the saved connection */
      memset( pxConnection, 0, sizeof( SlBtConnections_t ) );
      pxConnection->ucAdapterIf = SL_BT_INVALID_IF_HANDLE;
    }
  }

  SILABS_BLE_LOG_FUNC_EXIT_INFO( "status=%d", eBTStatusSuccess );
}

/* Invoked on Bluetooth event to handle events the BLE adapter needs. */
void prvBleAdapterOnSlBtEvent( sl_bt_msg_t* evt )
{
  switch( SL_BT_MSG_ID( evt->header ) ) {
    case sl_bt_evt_advertiser_timeout_id:
      prvOnAdvertiserTimeout( &evt->data.evt_advertiser_timeout );
      break;

    case sl_bt_evt_connection_opened_id:
      prvOnConnectionOpened( &evt->data.evt_connection_opened );
      break;

    case sl_bt_evt_connection_parameters_id:
      prvOnConnectionParameters( &evt->data.evt_connection_parameters );
      break;

    case sl_bt_evt_connection_closed_id:
      prvOnConnectionClosed( &evt->data.evt_connection_closed );
      break;

    case sl_bt_evt_scanner_scan_report_id:
      prvOnScanReportEvent( &evt->data.evt_scanner_scan_report );
      break;

    case sl_bt_evt_sm_bonded_id:
      prvOnBonded( &evt->data.evt_sm_bonded );
      break;

    /* Other events are ignored */
    default:
      break;
  }
}
